{
  "merges": {
    "32,99": 258,
    "105,110": 259,
    "32,115": 260,
    "101,114": 261,
    "97,110": 262,
    "32,111": 263,
    "32,116": 264,
    "97,114": 265,
    "101,100": 266,
    "32,98": 267,
    "101,115": 268,
    "32,112": 269,
    "32,109": 270,
    "97,116": 271,
    "105,108": 272,
    "114,101": 273,
    "117,116": 274,
    "111,110": 275,
    "101,110": 276,
    "97,108": 277,
    "262,100": 278,
    "111,117": 279,
    "32,278": 280,
    "32,102": 281,
    "259,103": 282,
    "258,104": 283,
    "32,119": 284,
    "105,99": 285,
    "103,265": 286,
    "264,111": 287,
    "115,112": 288,
    "112,112": 289,
    "32,259": 290,
    "108,101": 291,
    "111,114": 292,
    "101,108": 293,
    "114,111": 294,
    "97,107": 295,
    "279,114": 296,
    "97,115": 297,
    "97,109": 298,
    "105,116": 299,
    "117,286": 300,
    "32,67": 301,
    "32,100": 302,
    "263,110": 303,
    "32,97": 304,
    "260,300": 305,
    "32,101": 306,
    "116,261": 307,
    "32,108": 308,
    "260,277": 309,
    "32,103": 310,
    "264,288": 311,
    "105,120": 312,
    "269,101": 313,
    "104,101": 314,
    "111,111": 315,
    "309,116": 316,
    "32,83": 317,
    "105,275": 318,
    "259,101": 319,
    "103,101": 320,
    "97,99": 321,
    "117,110": 322,
    "105,115": 323,
    "103,103": 324,
    "100,100": 325,
    "46,10": 326,
    "111,119": 327,
    "274,307": 328,
    "306,324": 329,
    "32,40": 330,
    "281,108": 331,
    "268,101": 332,
    "32,66": 333,
    "32,84": 334,
    "273,298": 335,
    "295,101": 336,
    "32,80": 337,
    "283,101": 338,
    "272,108": 339,
    "285,107": 340,
    "338,332": 341,
    "32,118": 342,
    "267,328": 343,
    "303,318": 344,
    "32,322": 345,
    "111,108": 346,
    "117,115": 347,
    "111,116": 348,
    "263,102": 349,
    "114,97": 350,
    "32,104": 351,
    "270,259": 352,
    "277,108": 353,
    "263,114": 354,
    "299,104": 355,
    "331,296": 356,
    "32,65": 357,
    "258,335": 358,
    "283,111": 359,
    "289,261": 360,
    "272,107": 361,
    "284,355": 362,
    "270,312": 363,
    "267,101": 364,
    "313,360": 365,
    "99,104": 366,
    "352,274": 367,
    "118,261": 368,
    "260,116": 369,
    "97,100": 370,
    "116,272": 371,
    "293,108": 372,
    "345,371": 373,
    "271,261": 374,
    "367,268": 375,
    "117,99": 376,
    "285,101": 377,
    "116,111": 378,
    "281,292": 379,
    "284,374": 380,
    "270,361": 381,
    "114,266": 382,
    "315,107": 383,
    "116,115": 384,
    "98,288": 385,
    "334,385": 386,
    "258,262": 387,
    "114,105": 388,
    "289,266": 389,
    "271,111": 390,
    "329,115": 391,
    "100,261": 392,
    "357,325": 393,
    "258,114": 394,
    "111,109": 395,
    "32,77": 396,
    "117,109": 397,
    "48,48": 398,
    "267,294": 399,
    "264,314": 400,
    "118,101": 401,
    "260,97": 402,
    "263,122": 403,
    "105,114": 404,
    "32,110": 405,
    "340,276": 406,
    "376,101": 407,
    "359,389": 408,
    "339,97": 409,
    "101,116": 410,
    "32,106": 411,
    "108,285": 412,
    "262,409": 413,
    "342,413": 414,
    "92,117": 415,
    "103,104": 416,
    "267,295": 417,
    "260,104": 418,
    "290,378": 419,
    "117,112": 420,
    "32,271": 421,
    "116,104": 422,
    "264,104": 423,
    "119,110": 424,
    "114,121": 425,
    "417,282": 426,
    "32,291": 427,
    "46,41": 428,
    "402,407": 429,
    "310,273": 430,
    "327,392": 431,
    "270,265": 432,
    "105,101": 433,
    "260,111": 434,
    "269,431": 435,
    "263,368": 436,
    "333,336": 437,
    "284,104": 438,
    "97,121": 439,
    "310,114": 440,
    "297,116": 441,
    "273,370": 442,
    "283,406": 443,
    "279,112": 444,
    "108,121": 445,
    "117,273": 446,
    "271,101": 447,
    "32,82": 448,
    "110,100": 449,
    "258,383": 450,
    "263,272": 451,
    "390,268": 452,
    "101,271": 453,
    "105,276": 454,
    "399,424": 455,
    "262,115": 456,
    "321,107": 457,
    "108,268": 458,
    "347,104": 459,
    "258,111": 460,
    "260,444": 461,
    "382,454": 462,
    "282,462": 463,
    "32,463": 464,
    "464,384": 465,
    "105,112": 466,
    "274,115": 467,
    "109,275": 468,
    "99,346": 469,
    "286,319": 470,
    "32,114": 471,
    "53,48": 472,
    "292,110": 473,
    "117,114": 474,
    "115,116": 475,
    "287,109": 476,
    "97,98": 477,
    "411,117": 478,
    "279,449": 479,
    "32,87": 480,
    "432,470": 481,
    "308,98": 482,
    "116,446": 483,
    "478,377": 484,
    "267,111": 485,
    "269,262": 486,
    "32,273": 487,
    "363,483": 488,
    "32,68": 489,
    "308,265": 490,
    "260,112": 491,
    "490,320": 492,
    "101,102": 493,
    "301,104": 494,
    "105,109": 495,
    "105,416": 496,
    "51,472": 497,
    "430,276": 498,
    "284,372": 499,
    "109,353": 500,
    "259,366": 501,
    "107,103": 502,
    "269,502": 503,
    "32,286": 504,
    "350,259": 505,
    "32,353": 506,
    "289,291": 507,
    "113,117": 508,
    "304,325": 509,
    "323,104": 510,
    "114,268": 511,
    "260,101": 512,
    "422,261": 513,
    "258,473": 514,
    "504,412": 515,
    "314,271": 516,
    "105,100": 517,
    "281,294": 518,
    "118,268": 519,
    "45,501": 520,
    "100,97": 521,
    "261,121": 522,
    "269,433": 523,
    "434,521": 524,
    "111,291": 525,
    "315,108": 526,
    "496,116": 527,
    "317,112": 528,
    "397,98": 529,
    "347,116": 530,
    "41,44": 531,
    "260,412": 532,
    "427,468": 533,
    "294,395": 534,
    "337,296": 535,
    "271,266": 536,
    "259,110": 537,
    "116,266": 538,
    "317,116": 539,
    "116,276": 540,
    "118,276": 541,
    "395,98": 542,
    "293,522": 543,
    "351,296": 544,
    "261,115": 545,
    "258,543": 546,
    "258,420": 547,
    "469,447": 548,
    "32,70": 549,
    "32,121": 550,
    "396,312": 551,
    "344,115": 552,
    "97,507": 553,
    "542,319": 554,
    "320,513": 555,
    "287,555": 556,
    "459,534": 557,
    "297,115": 558,
    "269,348": 559,
    "405,467": 560,
    "319,553": 561,
    "97,112": 562,
    "97,320": 563,
    "485,272": 564,
    "105,102": 565,
    "298,275": 566,
    "321,101": 567,
    "49,48": 568,
    "97,259": 569,
    "537,566": 570,
    "99,268": 571,
    "260,500": 572,
    "364,493": 573,
    "270,557": 574,
    "258,570": 575,
    "440,479": 576,
    "103,261": 577,
    "266,105": 578,
    "460,99": 579,
    "108,567": 580,
    "321,104": 581,
    "77,312": 582,
    "265,115": 583,
    "346,100": 584,
    "267,108": 585,
    "260,296": 586,
    "98,261": 587,
    "269,561": 588,
    "287,112": 589,
    "369,404": 590,
    "394,529": 591,
    "299,101": 592,
    "32,516": 593,
    "258,275": 594,
    "539,404": 595,
    "578,397": 596,
    "109,101": 597,
    "111,112": 598,
    "263,541": 599,
    "364,271": 600,
    "327,108": 601,
    "270,596": 602,
    "267,601": 603,
    "302,505": 604,
    "32,73": 605,
    "359,548": 606,
    "111,401": 607,
    "259,107": 608,
    "270,293": 609,
    "115,104": 610,
    "297,104": 611,
    "267,442": 612,
    "279,416": 613,
    "319,286": 614,
    "265,109": 615,
    "32,76": 616,
    "111,275": 617,
    "323,101": 618,
    "342,614": 619,
    "313,99": 620,
    "315,100": 621,
    "32,120": 622,
    "258,336": 623,
    "111,274": 624,
    "476,452": 625,
    "559,452": 626,
    "558,261": 627,
    "114,608": 628,
    "260,261": 629,
    "265,100": 630,
    "627,525": 631,
    "301,383": 632,
    "476,390": 633,
    "487,109": 634,
    "102,102": 635,
    "295,268": 636,
    "122,276": 637,
    "302,510": 638,
    "480,104": 639,
    "351,348": 640,
    "114,282": 641,
    "117,98": 642,
    "105,268": 643,
    "258,265": 644,
    "532,266": 645,
    "628,291": 646,
    "270,439": 647,
    "101,109": 648,
    "97,103": 649,
    "620,456": 650,
    "266,100": 651,
    "651,265": 652,
    "591,115": 653,
    "302,425": 654,
    "110,97": 655,
    "119,101": 656,
    "105,273": 657,
    "440,536": 658,
    "297,266": 659,
    "301,526": 660,
    "320,116": 661,
    "364,456": 662,
    "394,457": 663,
    "388,268": 664,
    "661,477": 665,
    "471,377": 666,
    "32,294": 667,
    "317,261": 668,
    "441,101": 669,
    "262,116": 670,
    "111,368": 671,
    "293,121": 672,
    "609,538": 673,
    "276,100": 674,
    "101,665": 675,
    "111,97": 676,
    "656,410": 677,
    "108,108": 678,
    "304,98": 679,
    "258,108": 680,
    "369,340": 681,
    "466,115": 682,
    "116,318": 683,
    "259,115": 684,
    "270,453": 685,
    "494,652": 686,
    "258,274": 687,
    "32,323": 688,
    "262,320": 689,
    "51,48": 690,
    "283,682": 691,
    "118,282": 692,
    "438,592": 693,
    "275,655": 694,
    "540,282": 695,
    "694,618": 696,
    "292,695": 697,
    "32,277": 698,
    "679,624": 699,
    "265,116": 700,
    "32,107": 701,
    "342,675": 702,
    "634,569": 703,
    "117,299": 704,
    "111,273": 705,
    "511,115": 706,
    "511,104": 707,
    "97,118": 708,
    "647,696": 709,
    "49,50": 710,
    "49,53": 711,
    "518,109": 712,
    "32,350": 713,
    "518,637": 714,
    "32,71": 715,
    "32,382": 716,
    "337,580": 717,
    "703,282": 718,
    "291,121": 719,
    "109,261": 720,
    "32,297": 721,
    "101,121": 722,
    "530,630": 723,
    "450,266": 724,
    "418,697": 725,
    "117,635": 726,
    "308,527": 727,
    "117,108": 728,
    "32,72": 729,
    "388,577": 730,
    "99,469": 731,
    "731,105": 732,
    "275,274": 733,
    "604,266": 734,
    "297,275": 735,
    "321,275": 736,
    "50,53": 737,
    "111,115": 738,
    "430,659": 739,
    "351,277": 740,
    "260,108": 741,
    "423,276": 742,
    "283,272": 743,
    "583,719": 744,
    "101,112": 745,
    "269,744": 746,
    "41,10": 747,
    "306,120": 748,
    "544,115": 749,
    "304,289": 750,
    "117,325": 751,
    "629,692": 752,
    "270,723": 753,
    "751,282": 754,
    "276,392": 755,
    "459,266": 756,
    "281,707": 757,
    "264,669": 758,
    "394,756": 759,
    "644,294": 760,
    "301,671": 761,
    "100,266": 762,
    "517,101": 763,
    "528,646": 764,
    "50,48": 765,
    "260,107": 766,
    "579,733": 767,
    "267,736": 768,
    "101,99": 769,
    "600,276": 770,
    "639,466": 771,
    "418,382": 772,
    "350,119": 773,
    "265,101": 774,
    "269,562": 775,
    "313,262": 776,
    "267,348": 777,
    "772,762": 778,
    "107,115": 779,
    "564,282": 780,
    "108,105": 781,
    "475,670": 782,
    "667,678": 783,
    "105,122": 784,
    "49,51": 785,
    "512,735": 786,
    "587,425": 787,
    "574,115": 788,
    "310,350": 789,
    "291,116": 790,
    "668,401": 791,
    "258,526": 792,
    "262,262": 793,
    "434,102": 794,
    "648,607": 795,
    "351,298": 796,
    "267,336": 797,
    "317,277": 798,
    "269,754": 799,
    "285,266": 800,
    "263,781": 801,
    "109,361": 802,
    "306,581": 803,
    "67,104": 804,
    "354,689": 805,
    "116,116": 806,
    "587,664": 807,
    "301,336": 808,
    "448,795": 809,
    "281,404": 810,
    "523,571": 811,
    "387,115": 812,
    "495,720": 813,
    "276,116": 814,
    "67,554": 815,
    "605,110": 816,
    "110,467": 817,
    "302,800": 818,
    "323,99": 819,
    "532,268": 820,
    "405,274": 821,
    "760,384": 822,
    "258,631": 823,
    "399,422": 824,
    "337,274": 825,
    "615,268": 826,
    "826,262": 827,
    "435,266": 828,
    "111,272": 829,
    "273,297": 830,
    "439,261": 831,
    "480,292": 832,
    "750,458": 833,
    "418,372": 834,
    "610,657": 835,
    "399,732": 836,
    "460,368": 837,
    "485,120": 838,
    "621,458": 839,
    "307,835": 840,
    "301,554": 841,
    "571,840": 842,
    "323,684": 843,
    "289,282": 844,
    "708,292": 845,
    "706,282": 846,
    "396,636": 847,
    "495,101": 848,
    "832,842": 849,
    "323,115": 850,
    "740,102": 851,
    "337,827": 852,
    "269,108": 853,
    "102,108": 854,
    "347,563": 855,
    "264,755": 856,
    "597,103": 857,
    "487,102": 858,
    "114,704": 859,
    "333,453": 860,
    "713,843": 861,
    "121,114": 862,
    "821,857": 863,
    "862,420": 864,
    "292,107": 865,
    "294,424": 866,
    "263,291": 867,
    "867,111": 868,
    "269,296": 869,
    "405,839": 870,
    "260,864": 871,
    "32,262": 872,
    "283,261": 873,
    "590,641": 874,
    "268,116": 875,
    "104,298": 876,
    "528,442": 877,
    "663,545": 878,
    "346,108": 879,
    "579,676": 880,
    "117,101": 881,
    "743,105": 882,
    "798,370": 883,
    "369,773": 884,
    "411,372": 885,
    "112,115": 886,
    "32,74": 887,
    "275,101": 888,
    "858,730": 889,
    "585,457": 890,
    "32,75": 891,
    "394,530": 892,
    "267,793": 893,
    "776,274": 894,
    "111,519": 895,
    "101,97": 896,
    "474,110": 897,
    "301,631": 898,
    "260,109": 899,
    "680,895": 900,
    "260,314": 901,
    "365,115": 902,
    "100,115": 903,
    "272,790": 904,
    "343,802": 905,
    "271,115": 906,
    "438,105": 907,
    "353,121": 908,
    "500,327": 909,
    "274,101": 910,
    "302,846": 911,
    "260,677": 912,
    "41,46": 913,
    "786,282": 914,
    "116,114": 915,
    "258,584": 916,
    "265,366": 917,
    "260,410": 918,
    "32,314": 919,
    "32,420": 920,
    "258,642": 921,
    "378,109": 922,
    "32,299": 923,
    "547,115": 924,
    "98,474": 925,
    "585,674": 926,
    "308,105": 927,
    "308,327": 928,
    "337,433": 929,
    "309,370": 930,
    "475,917": 931,
    "366,259": 932,
    "52,53": 933,
    "702,291": 934,
    "281,339": 935,
    "260,508": 936,
    "282,261": 937,
    "97,401": 938,
    "766,904": 939,
    "112,262": 940,
    "73,110": 941,
    "402,855": 942,
    "616,410": 943,
    "302,613": 944,
    "514,931": 945,
    "284,277": 946,
    "32,79": 947,
    "263,274": 948,
    "32,347": 949,
    "388,266": 950,
    "262,111": 951,
    "663,261": 952,
    "111,99": 953,
    "438,525": 954,
    "512,266": 955,
    "269,457": 956,
    "32,69": 957,
    "450,433": 958,
    "901,410": 959,
    "101,119": 960,
    "268,115": 961,
    "269,273": 962,
    "334,598": 963,
    "49,54": 964,
    "388,109": 965,
    "105,262": 966,
    "432,610": 967,
    "967,909": 968,
    "284,615": 969,
    "101,266": 970,
    "925,577": 971,
    "32,774": 972,
    "315,422": 973,
    "893,297": 974,
    "301,114": 975,
    "102,705": 976,
    "364,976": 977,
    "946,817": 978,
    "273,103": 979,
    "122,122": 980,
    "683,277": 981,
    "450,282": 982,
    "331,845": 983,
    "290,782": 984,
    "55,53": 985,
    "310,937": 986,
    "397,112": 987,
    "427,97": 988,
    "45,112": 989,
    "429,940": 990,
    "899,973": 991,
    "273,101": 992,
    "267,353": 993,
    "854,296": 994,
    "107,97": 995,
    "448,879": 996,
    "777,922": 997,
    "293,116": 998,
    "321,116": 999,
    "702,458": 1000,
    "527,445": 1001,
    "32,86": 1002,
    "301,274": 1003,
    "698,468": 1004,
    "477,98": 1005,
    "935,282": 1006,
    "275,105": 1007,
    "885,111": 1008,
    "99,266": 1009,
    "1005,563": 1010,
    "99,99": 1011,
    "540,266": 1012,
    "979,951": 1013,
    "263,1013": 1014,
    "423,340": 1015,
    "271,307": 1016,
    "405,348": 1017,
    "299,268": 1018,
    "260,813": 1019,
    "598,981": 1020,
    "295,266": 1021,
    "281,859": 1022,
    "267,372": 1023,
    "103,273": 1024,
    "67,383": 1025,
    "352,1009": 1026,
    "748,915": 1027,
    "830,384": 1028,
    "388,995": 1029,
    "98,328": 1030,
    "271,672": 1031,
    "308,831": 1032,
    "438,1018": 1033,
    "264,477": 1034,
    "51,985": 1035,
    "489,505": 1036,
    "302,888": 1037,
    "1027,999": 1038,
    "103,268": 1039,
    "775,1029": 1040,
    "474,112": 1041,
    "372,327": 1042,
    "411,265": 1043,
    "116,291": 1044,
    "423,259": 1045,
    "112,617": 1046,
    "101,277": 1047,
    "727,445": 1048,
    "115,300": 1049,
    "267,1028": 1050,
    "269,865": 1051,
    "39,83": 1052,
    "264,896": 1053,
    "968,115": 1054,
    "303,101": 1055,
    "313,293": 1056,
    "965,112": 1057,
    "458,1046": 1058,
    "550,346": 1059,
    "1034,1058": 1060,
    "738,101": 1061,
    "334,104": 1062,
    "376,932": 1063,
    "1063,105": 1064,
    "32,276": 1065,
    "284,97": 1066,
    "112,265": 1067,
    "597,277": 1068,
    "721,763": 1069,
    "97,119": 1070,
    "281,259": 1071,
    "32,565": 1072,
    "116,277": 1073,
    "810,475": 1074,
    "494,339": 1075,
    "348,116": 1076,
    "101,441": 1077,
    "789,876": 1078,
    "108,674": 1079,
    "269,580": 1080,
    "314,332": 1081,
    "112,101": 1082,
    "752,115": 1083,
    "302,268": 1084,
    "67,335": 1085,
    "372,97": 1086,
    "80,273": 1087,
    "265,1086": 1088,
    "111,980": 1089,
    "1089,1088": 1090,
    "276,115": 1091,
    "794,1012": 1092,
    "105,382": 1093,
    "101,324": 1094,
    "508,700": 1095,
    "357,449": 1096,
    "110,101": 1097,
    "1041,1061": 1098,
    "1084,1093": 1099,
    "676,102": 1100,
    "884,807": 1101,
    "850,346": 1102,
    "115,677": 1103,
    "594,116": 1104,
    "907,389": 1105,
    "1073,966": 1106,
    "927,508": 1107,
    "314,806": 1108,
    "649,1108": 1109,
    "1109,105": 1110,
    "322,366": 1111,
    "1071,672": 1112,
    "264,848": 1113,
    "434,121": 1114,
    "118,266": 1115,
    "989,1098": 1116,
    "284,319": 1117,
    "801,401": 1118,
    "668,519": 1119,
    "114,116": 1120,
    "427,116": 1121,
    "52,48": 1122,
    "111,548": 1123,
    "396,1090": 1124,
    "258,554": 1125,
    "297,272": 1126,
    "51,737": 1127,
    "784,101": 1128,
    "263,513": 1129,
    "321,265": 1130,
    "107,259": 1131,
    "32,89": 1132,
    "584,276": 1133,
    "345,99": 1134,
    "99,101": 1135,
    "32,377": 1136,
    "283,339": 1137,
    "302,611": 1138,
    "101,101": 1139,
    "550,1077": 1140,
    "629,401": 1141,
    "288,617": 1142,
    "370,101": 1143,
    "258,1010": 1144,
    "1053,1142": 1145,
    "100,1091": 1146,
    "1146,266": 1147,
    "313,297": 1148,
    "294,119": 1149,
    "801,519": 1150,
    "1130,1007": 1151,
    "366,406": 1152,
    "101,745": 1153,
    "114,479": 1154,
    "101,120": 1155,
    "1107,517": 1156,
    "269,274": 1157,
    "775,261": 1158,
    "270,705": 1159,
    "267,1016": 1160,
    "1059,779": 1161,
    "657,99": 1162,
    "565,116": 1163,
    "491,646": 1164,
    "796,971": 1165,
    "987,1131": 1166,
    "258,395": 1167,
    "302,1162": 1168,
    "680,607": 1169,
    "287,1120": 1170,
    "110,527": 1171,
    "873,664": 1172,
    "271,292": 1173,
    "819,704": 1174,
    "317,97": 1175,
    "310,1133": 1176,
    "294,112": 1177,
    "388,288": 1178,
    "331,636": 1179,
    "32,78": 1180,
    "122,1064": 1181,
    "267,1126": 1182,
    "436,1171": 1183,
    "741,1001": 1184,
    "52,398": 1185,
    "729,453": 1186,
    "45,1095": 1187,
    "39,115": 1188,
    "293,271": 1189,
    "594,1147": 1190,
    "32,113": 1191,
    "605,1106": 1192,
    "293,115": 1193,
    "267,649": 1194,
    "267,121": 1195,
    "287,844": 1196,
    "428,44": 1197,
    "1191,116": 1198,
    "550,1042": 1199,
    "285,1149": 1200,
    "613,445": 1201,
    "302,111": 1202,
    "269,495": 1203,
    "292,1201": 1204,
    "103,1154": 1205,
    "369,278": 1206,
    "794,116": 1207,
    "508,340": 1208,
    "66,866": 1209,
    "321,111": 1210,
    "491,442": 1211,
    "310,1189": 1212,
    "418,1057": 1213,
    "269,441": 1214,
    "632,643": 1215,
    "489,466": 1216,
    "1200,938": 1217,
    "1087,516": 1218,
    "493,730": 1219,
    "327,261": 1220,
    "889,1173": 1221,
    "301,335": 1222,
    "427,806": 1223,
    "265,98": 1224,
    "819,111": 1225,
    "423,1204": 1226,
    "491,1110": 1227,
    "1223,407": 1228,
    "1104,569": 1229,
    "259,581": 1230,
    "887,372": 1231,
    "308,1100": 1232,
    "260,1128": 1233,
    "281,271": 1234,
    "333,1079": 1235,
    "745,116": 1236,
    "494,406": 1237,
    "810,109": 1238,
    "448,1219": 1239,
    "993,115": 1240,
    "349,102": 1241,
    "1076,563": 1242,
    "992,122": 1243,
    "101,295": 1244,
    "348,104": 1245,
    "333,101": 1246,
    "98,291": 1247,
    "921,268": 1248,
    "32,1181": 1249,
    "272,101": 1250,
    "317,104": 1251,
    "281,621": 1252,
    "1239,447": 1253,
    "107,722": 1254,
    "783,115": 1255,
    "107,101": 1256,
    "550,279": 1257,
    "949,101": 1258,
    "376,529": 1259,
    "549,584": 1260,
    "275,722": 1261,
    "99,1236": 1262,
    "356,266": 1263,
    "271,446": 1264,
    "308,275": 1265,
    "333,442": 1266,
    "302,950": 1267,
    "681,115": 1268,
    "114,262": 1269,
    "363,266": 1270,
    "102,769": 1271,
    "611,266": 1272,
    "270,336": 1273,
    "258,346": 1274,
    "102,307": 1275,
    "873,425": 1276,
    "51,53": 1277,
    "270,1151": 1278,
    "565,538": 1279,
    "1004,903": 1280,
    "32,85": 1281,
    "263,906": 1282,
    "683,115": 1283,
    "333,641": 1284,
    "105,293": 1285,
    "117,908": 1286,
    "1271,683": 1287,
    "1212,259": 1288,
    "804,406": 1289,
    "304,507": 1290,
    "975,1225": 1291,
    "301,1081": 1292,
    "363,282": 1293,
    "258,1242": 1294,
    "1287,545": 1295,
    "108,266": 1296,
    "45,79": 1297,
    "1024,659": 1298,
    "114,689": 1299,
    "369,726": 1300,
    "276,266": 1301,
    "260,99": 1302,
    "267,1174": 1303,
    "1229,261": 1304,
    "410,97": 1305,
    "350,98": 1306,
    "926,266": 1307,
    "350,121": 1308,
    "748,1262": 1309,
    "269,669": 1310,
    "285,104": 1311,
    "1056,266": 1312,
    "269,456": 1313,
    "423,406": 1314,
    "265,259": 1315,
    "448,377": 1316,
    "837,266": 1317,
    "528,617": 1318,
    "262,1039": 1319,
    "293,401": 1320,
    "594,1295": 1321,
    "639,276": 1322,
    "455,266": 1323,
    "571,115": 1324,
    "264,474": 1325,
    "491,617": 1326,
    "303,378": 1327,
    "348,452": 1328,
    "271,1068": 1329,
    "276,378": 1330,
    "313,581": 1331,
    "264,1210": 1332,
    "100,1286": 1333,
    "99,814": 1334,
    "782,445": 1335,
    "310,108": 1336,
    "594,1335": 1337,
    "1274,292": 1338,
    "906,420": 1339,
    "1060,115": 1340,
    "261,425": 1341,
    "284,339": 1342,
    "354,1319": 1343,
    "988,519": 1344,
    "1203,1330": 1345,
    "337,101": 1346,
    "83,116": 1347,
    "77,998": 1348,
    "701,410": 1349,
    "99,335": 1350,
    "708,121": 1351,
    "115,101": 1352,
    "489,1177": 1353,
    "565,102": 1354,
    "260,1279": 1355,
    "269,1166": 1356,
    "343,266": 1357,
    "1320,1305": 1358,
    "333,114": 1359,
    "105,118": 1360,
    "282,115": 1361,
    "351,1261": 1362,
    "258,1339": 1363,
    "369,388": 1364,
    "423,323": 1365,
    "110,366": 1366,
    "281,829": 1367,
    "285,262": 1368,
    "279,110": 1369,
    "383,266": 1370,
    "121,291": 1371,
    "32,388": 1372,
    "956,563": 1373,
    "283,322": 1374,
    "559,390": 1375,
    "394,262": 1376,
    "830,101": 1377,
    "281,425": 1378,
    "100,282": 1379,
    "1066,120": 1380,
    "265,112": 1381,
    "294,732": 1382,
    "291,262": 1383,
    "1132,1285": 1384,
    "45,102": 1385,
    "1094,115": 1386,
    "1065,613": 1387,
    "267,439": 1388,
    "317,813": 1389,
    "517,268": 1390,
    "1300,282": 1391,
    "267,279": 1392,
    "80,101": 1393,
    "339,275": 1394,
    "333,866": 1395,
    "290,366": 1396,
    "111,103": 1397,
    "333,328": 1398,
    "1392,1394": 1399,
    "491,1230": 1400,
    "299,1044": 1401,
    "121,597": 1402,
    "919,1351": 1403,
    "471,479": 1404,
    "265,268": 1405,
    "269,340": 1406,
    "369,1244": 1407,
    "83,112": 1408,
    "260,1390": 1409,
    "299,115": 1410,
    "259,100": 1411,
    "258,1259": 1412,
    "72,453": 1413,
    "423,1402": 1414,
    "269,116": 1415,
    "423,1070": 1416,
    "983,282": 1417,
    "1364,886": 1418,
    "114,323": 1419,
    "418,1381": 1420,
    "562,101": 1421,
    "115,97": 1422,
    "258,278": 1423,
    "281,319": 1424,
    "562,292": 1425,
    "1002,1358": 1426,
    "118,1425": 1427,
    "558,268": 1428,
    "270,1272": 1429,
    "98,442": 1430,
    "306,1427": 1431,
    "302,339": 1432,
    "302,101": 1433,
    "116,275": 1434,
    "396,998": 1435,
    "1102,401": 1436,
    "359,886": 1437,
    "411,530": 1438,
    "366,420": 1439,
    "962,1067": 1440,
    "1431,536": 1441,
    "276,307": 1442,
    "339,297": 1443,
    "270,726": 1444,
    "110,722": 1445,
    "264,897": 1446,
    "270,111": 1447,
    "267,275": 1448,
    "97,272": 1449,
    "889,447": 1450,
    "271,268": 1451,
    "884,787": 1452,
    "342,522": 1453,
    "667,441": 1454,
    "273,1366": 1455,
    "317,108": 1456,
    "261,98": 1457,
    "258,1442": 1458,
    "334,897": 1459,
    "306,541": 1460,
    "671,266": 1461,
    "304,1011": 1462,
    "741,377": 1463,
    "304,1275": 1464,
    "1349,1439": 1465,
    "471,875": 1466,
    "1170,1443": 1467,
    "1168,1283": 1468,
    "1416,266": 1469,
    "112,261": 1470,
    "1440,266": 1471,
    "260,763": 1472,
    "110,510": 1473,
    "1062,276": 1474,
    "99,473": 1475,
    "292,1379": 1476,
    "308,439": 1477,
    "517,1445": 1478,
    "363,261": 1479,
    "119,104": 1480,
    "119,850": 1481,
    "346,1428": 1482,
    "115,261": 1483,
    "308,1401": 1484,
    "367,101": 1485,
    "45,1103": 1486,
    "743,643": 1487,
    "101,384": 1488,
    "1462,1476": 1489,
    "268,261": 1490,
    "83,97": 1491,
    "1134,1461": 1492,
    "285,268": 1493,
    "814,445": 1494,
    "108,100": 1495,
    "784,122": 1496,
    "327,110": 1497,
    "279,115": 1498,
    "450,643": 1499,
    "953,107": 1500,
    "776,467": 1501,
    "264,700": 1502,
    "919,370": 1503,
    "741,327": 1504,
    "701,1478": 1505,
    "80,580": 1506,
    "921,266": 1507,
    "302,279": 1508,
    "304,112": 1509,
    "109,265": 1510,
    "369,277": 1511,
    "634,607": 1512,
    "307,110": 1513,
    "66,453": 1514,
    "102,728": 1515,
    "281,1243": 1516,
    "308,848": 1517,
    "936,611": 1518,
    "49,52": 1519,
    "988,102": 1520,
    "1369,116": 1521,
    "267,273": 1522,
    "345,1298": 1523,
    "1331,268": 1524,
    "258,474": 1525,
    "1325,1254": 1526,
    "267,274": 1527,
    "379,109": 1528,
    "294,120": 1529,
    "109,105": 1530,
    "1224,769": 1531,
    "288,377": 1532,
    "317,1163": 1533,
    "397,259": 1534,
    "297,318": 1535,
    "648,1470": 1536,
    "1011,1535": 1537,
    "323,1208": 1538,
    "1460,445": 1539,
    "317,410": 1540,
    "1004,100": 1541,
    "1529,495": 1542,
    "263,1537": 1543,
    "853,569": 1544,
    "512,1530": 1545,
    "635,1139": 1546,
    "351,278": 1547,
    "1477,545": 1548,
    "317,444": 1549,
    "550,296": 1550,
    "264,1536": 1551,
    "907,844": 1552,
    "348,390": 1553,
    "108,1220": 1554,
    "270,1482": 1555,
    "258,1306": 1556,
    "299,318": 1557,
    "1543,908": 1558,
    "506,1532": 1559,
    "1542,1031": 1560,
    "97,728": 1561,
    "376,107": 1562,
    "642,98": 1563,
    "715,350": 1564,
    "32,508": 1565,
    "1551,1264": 1566,
    "1510,470": 1567,
    "491,970": 1568,
    "263,1329": 1569,
    "379,107": 1570,
    "258,294": 1571,
    "117,100": 1572,
    "369,1354": 1573,
    "269,111": 1574,
    "438,276": 1575,
    "298,101": 1576,
    "115,115": 1577,
    "585,755": 1578,
    "1303,115": 1579,
    "283,875": 1580,
    "936,1405": 1581,
    "1496,97": 1582,
    "1561,565": 1583,
    "1583,1554": 1584,
    "261,110": 1585,
    "350,112": 1586,
    "317,1481": 1587,
    "512,1067": 1588,
    "1580,817": 1589,
    "345,98": 1590,
    "264,119": 1591,
    "99,111": 1592,
    "726,121": 1593,
    "278,1315": 1594,
    "269,501": 1595,
    "956,266": 1596,
    "738,115": 1597,
    "302,1451": 1598,
    "549,1455": 1599,
    "834,115": 1600,
    "804,1123": 1601,
    "616,831": 1602,
    "265,384": 1603,
    "740,519": 1604,
    "270,1047": 1605,
    "264,642": 1606,
    "322,100": 1607,
    "353,115": 1608,
    "267,1563": 1609,
    "105,392": 1610,
    "262,274": 1611,
    "114,613": 1612,
    "297,121": 1613,
    "302,1497": 1614,
    "440,262": 1615,
    "423,1612": 1616,
    "258,1383": 1617,
    "322,97": 1618,
    "1531,881": 1619,
    "417,266": 1620,
    "297,101": 1621,
    "265,107": 1622,
    "509,1557": 1623,
    "549,292": 1624,
    "293,102": 1625,
    "302,1102": 1626,
    "267,641": 1627,
    "1502,265": 1628,
    "258,1178": 1629,
    "1066,102": 1630,
    "337,706": 1631,
    "266,1039": 1632,
    "81,117": 1633,
    "276,1097": 1634,
    "32,298": 1635,
    "67,274": 1636,
    "331,1593": 1637,
    "117,678": 1638,
    "512,99": 1639,
    "1214,425": 1640,
    "491,1308": 1641,
    "438,1250": 1642,
    "1444,259": 1643,
    "591,1296": 1644,
    "448,111": 1645,
    "477,624": 1646,
    "387,110": 1647,
    "99,107": 1648,
    "1508,1247": 1649,
    "405,970": 1650,
    "480,355": 1651,
    "489,111": 1652,
    "351,630": 1653,
    "333,1538": 1654,
    "80,274": 1655,
    "110,103": 1656,
    "107,350": 1657,
    "270,1217": 1658,
    "609,116": 1659,
    "261,109": 1660,
    "116,1449": 1661,
    "471,1490": 1662,
    "715,1377": 1663,
    "427,441": 1664,
    "115,99": 1665,
    "600,282": 1666,
    "439,1634": 1667,
    "1245,261": 1668,
    "448,266": 1669,
    "1338,282": 1670,
    "1265,577": 1671,
    "1134,1370": 1672,
    "1167,112": 1673,
    "261,1047": 1674,
    "1175,407": 1675,
    "1155,116": 1676,
    "853,447": 1677,
    "294,637": 1678,
    "471,1411": 1679,
    "1374,779": 1680,
    "1590,1021": 1681,
    "258,1667": 1682,
    "442,121": 1683,
    "1511,779": 1684,
    "97,407": 1685,
    "99,336": 1686,
    "258,1610": 1687,
    "297,1592": 1688,
    "51,398": 1689,
    "1419,282": 1690,
    "585,881": 1691,
    "698,1513": 1692,
    "644,1434": 1693,
    "45,1690": 1694,
    "114,285": 1695,
    "112,774": 1696,
    "460,583": 1697,
    "269,294": 1698,
    "45,475": 1699,
    "333,829": 1700,
    "293,961": 1701,
    "1384,903": 1702,
    "32,265": 1703,
    "418,353": 1704,
    "405,275": 1705,
    "477,1688": 1706,
    "323,116": 1707,
    "1167,268": 1708,
    "474,116": 1709,
    "460,271": 1710,
    "466,101": 1711,
    "1045,445": 1712,
    "750,1560": 1713,
    "1336,558": 1714,
    "402,910": 1715,
    "728,265": 1716,
    "351,496": 1717,
    "334,1706": 1718,
    "1214,97": 1719,
    "786,266": 1720,
    "260,1625": 1721,
    "777,1044": 1722,
    "1504,445": 1723,
    "358,266": 1724,
    "1673,790": 1725,
    "258,1674": 1726,
    "1397,1709": 1727,
    "265,121": 1728,
    "108,510": 1729,
    "275,318": 1730,
    "50,52": 1731,
    "112,1328": 1732,
    "301,111": 1733,
    "728,536": 1734,
    "760,116": 1735,
    "270,1594": 1736,
    "114,1299": 1737,
    "1695,348": 1738,
    "66,829": 1739,
    "1314,266": 1740,
    "701,1585": 1741,
    "317,378": 1742,
    "1564,1333": 1743,
    "334,111": 1744,
    "395,101": 1745,
    "258,1584": 1746,
    "1572,320": 1747,
    "471,457": 1748,
    "491,1493": 1749,
    "258,1534": 1750,
    "32,1683": 1751,
    "698,101": 1752,
    "369,960": 1753,
    "118,293": 1754,
    "348,366": 1755,
    "400,109": 1756,
    "1725,672": 1757,
    "1103,1301": 1758,
    "368,277": 1759,
    "1626,1115": 1760,
    "297,649": 1761,
    "773,787": 1762,
    "1699,1371": 1763,
    "112,108": 1764,
    "302,439": 1765,
    "487,99": 1766,
    "1635,1521": 1767,
    "1615,1734": 1768,
    "1647,266": 1769,
    "1412,545": 1770,
    "1251,1421": 1771,
    "1606,101": 1772,
    "352,105": 1773,
    "396,336": 1774,
    "58,44": 1775,
    "512,1759": 1776,
    "430,1621": 1777,
    "579,107": 1778,
    "1778,1661": 1779,
    "281,960": 1780,
    "301,473": 1781,
    "1202,637": 1782,
    "259,266": 1783,
    "262,103": 1784,
    "471,618": 1785,
    "1372,1082": 1786,
    "1630,545": 1787,
    "1175,910": 1788,
    "458,115": 1789,
    "309,1422": 1790,
    "101,468": 1791,
    "1665,1755": 1792,
    "715,265": 1793,
    "720,1368": 1794,
    "550,1727": 1795,
    "475,282": 1796,
    "105,401": 1797,
    "105,97": 1798,
    "118,121": 1799,
    "872,1668": 1800,
    "302,388": 1801,
    "1591,111": 1802,
    "766,259": 1803,
    "423,271": 1804,
    "105,103": 1805,
    "1669,407": 1806,
    "301,314": 1807,
    "1265,103": 1808,
    "605,102": 1809,
    "514,1068": 1810,
    "1741,293": 1811,
    "277,562": 1812,
    "1812,276": 1813,
    "272,100": 1814,
    "115,111": 1815,
    "101,735": 1816,
    "283,1562": 1817,
    "98,108": 1818,
    "713,119": 1819,
    "98,115": 1820,
    "793,97": 1821,
    "549,339": 1822,
    "411,583": 1823,
    "105,266": 1824,
    "394,268": 1825,
    "1359,278": 1826,
    "269,259": 1827,
    "649,291": 1828,
    "1281,1352": 1829,
    "265,307": 1830,
    "1609,445": 1831,
    "267,114": 1832,
    "777,104": 1833,
    "269,706": 1834,
    "872,121": 1835,
    "1491,910": 1836,
    "308,441": 1837,
    "1062,323": 1838,
    "32,1208": 1839,
    "1522,441": 1840,
    "494,1123": 1841,
    "310,621": 1842,
    "1360,517": 1843,
    "357,1794": 1844,
    "269,700": 1845,
    "914,115": 1846,
    "287,441": 1847,
    "49,49": 1848,
    "833,1685": 1849,
    "289,121": 1850,
    "549,108": 1851,
    "357,1737": 1852,
    "1525,425": 1853,
    "345,1758": 1854,
    "957,1828": 1855,
    "337,273": 1856,
    "1170,409": 1857,
    "32,534": 1858,
    "1448,1701": 1859,
    "1825,1334": 1860,
    "927,1256": 1861,
    "259,881": 1862,
    "936,774": 1863,
    "1704,327": 1864,
    "1168,538": 1865,
    "729,496": 1866,
    "115,277": 1867,
    "460,1546": 1868,
    "284,516": 1869,
    "292,116": 1870,
    "351,297": 1871,
    "114,447": 1872,
    "102,1678": 1873,
    "418,1341": 1874,
    "644,298": 1875,
    "97,122": 1876,
    "281,584": 1877,
    "287,1577": 1878,
    "949,282": 1879,
    "269,271": 1880,
    "885,121": 1881,
    "297,932": 1882,
    "291,99": 1883,
    "271,318": 1884,
    "1882,111": 1885,
    "358,121": 1886,
    "302,466": 1887,
    "1698,1324": 1888,
    "1097,370": 1889,
    "792,266": 1890,
    "32,674": 1891,
    "331,1021": 1892,
    "265,294": 1893,
    "1376,787": 1894,
    "1456,377": 1895,
    "428,10": 1896,
    "45,99": 1897,
    "262,366": 1898,
    "1376,807": 1899,
    "32,495": 1900,
    "267,1410": 1901,
    "111,1256": 1902,
    "78,111": 1903,
    "701,1153": 1904,
    "44,44": 1905,
    "432,1885": 1906,
    "411,1813": 1907,
    "66,1382": 1908,
    "272,370": 1909,
    "45,84": 1910,
    "287,119": 1911,
    "533,1143": 1912,
    "337,1553": 1913,
    "275,103": 1914,
    "101,493": 1915,
    "317,1816": 1916,
    "264,1618": 1917,
    "302,1153": 1918,
    "69,1613": 1919,
    "67,1081": 1920,
    "1692,1031": 1921,
    "489,293": 1922,
    "337,754": 1923,
    "288,265": 1924,
    "111,107": 1925,
    "427,262": 1926,
    "273,597": 1927,
    "52,737": 1928,
    "281,510": 1929,
    "1509,1738": 1930,
    "265,111": 1931,
    "109,453": 1932,
    "713,288": 1933,
    "116,122": 1934,
    "369,1500": 1935,
    "299,122": 1936,
    "620,262": 1937,
    "54,48": 1938,
    "912,1301": 1939,
    "505,266": 1940,
    "405,1676": 1941,
    "1480,592": 1942,
    "1793,1473": 1943,
    "1761,655": 1944,
    "494,598": 1945,
    "1883,915": 1946,
    "1423,121": 1947,
    "441,285": 1948,
    "789,1333": 1949,
    "68,1436": 1950,
    "321,291": 1951,
    "1946,285": 1952,
    "404,1951": 1953,
    "1515,115": 1954,
    "1691,807": 1955,
    "109,578": 1956,
    "1742,273": 1957,
    "259,105": 1958,
    "1956,1031": 1959,
    "303,1135": 1960,
    "887,457": 1961,
    "891,1931": 1962,
    "301,262": 1963,
    "112,340": 1964,
    "267,1619": 1965,
    "396,275": 1966,
    "701,110": 1967,
    "306,1952": 1968,
    "302,1622": 1969,
    "283,105": 1970,
    "97,289": 1971,
    "351,938": 1972,
    "1302,353": 1973,
    "351,292": 1974,
    "1178,643": 1975,
    "337,1328": 1976,
    "893,97": 1977,
    "1565,1830": 1978,
    "299,738": 1979,
    "343,1792": 1980,
    "511,261": 1981,
    "33,10": 1982,
    "1155,1368": 1983,
    "310,1494": 1984,
    "1764,670": 1985,
    "270,101": 1986,
    "1639,275": 1987,
    "594,115": 1988,
    "274,266": 1989,
    "364,276": 1990,
    "368,121": 1991,
    "304,103": 1992,
    "49,56": 1993,
    "261,116": 1994,
    "281,1638": 1995,
    "351,611": 1996,
    "83,1163": 1997,
    "448,745": 1998,
    "487,103": 1999,
    "285,1076": 2000,
    "45,65": 2001,
    "273,295": 2002,
    "267,592": 2003,
    "370,510": 2004,
    "1754,598": 2005,
    "1137,266": 2006,
    "287,1245": 2007,
    "549,294": 2008,
    "351,1457": 2009,
    "1483,2004": 2010,
    "565,101": 2011,
    "1992,569": 2012,
    "2007,1964": 2013,
    "947,110": 2014,
    "1910,293": 2015,
    "284,970": 2016,
    "112,561": 2017,
    "798,116": 2018,
    "98,275": 2019,
    "891,1975": 2020,
    "298,115": 2021,
    "302,105": 2022,
    "432,259": 2023,
    "471,1361": 2024,
    "68,505": 2025,
    "845,592": 2026,
    "1703,479": 2027,
    "1393,1611": 2028,
    "66,1079": 2029,
    "279,1495": 2030,
    "1346,360": 2031,
    "1999,1716": 2032,
    "512,277": 2033,
    "789,1799": 2034,
    "448,1936": 2035,
    "301,275": 2036,
    "1065,2005": 2037,
    "1633,340": 2038,
    "1974,2010": 2039,
    "111,121": 2040,
    "269,1582": 2041,
    "298,112": 2042,
    "961,1994": 2043,
    "564,261": 2044,
    "67,473": 2045,
    "1385,271": 2046,
    "121,1042": 2047,
    "268,1576": 2048,
    "396,1953": 2049,
    "66,1021": 2050,
    "269,261": 2051,
    "292,115": 2052,
    "337,1111": 2053,
    "1967,2011": 2054,
    "1998,453": 2055,
    "267,1111": 2056,
    "1650,266": 2057,
    "267,583": 2058,
    "789,112": 2059,
    "345,100": 2060,
    "564,266": 2061,
    "334,1597": 2062,
    "110,348": 2063,
    "278,121": 2064,
    "76,1791": 2065,
    "516,266": 2066,
    "108,282": 2067,
    "295,282": 2068,
    "844,115": 2069,
    "102,261": 2070,
    "281,950": 2071,
    "67,114": 2072,
    "610,697": 2073,
    "116,282": 2074,
    "1801,2069": 2075,
    "853,1948": 2076,
    "83,104": 2077,
    "104,642": 2078,
    "308,276": 2079,
    "2078,1224": 2080,
    "323,540": 2081,
    "593,266": 2082,
    "549,425": 2083,
    "549,859": 2084,
    "92,116": 2085,
    "269,479": 2086,
    "475,299": 2087,
    "306,1991": 2088,
    "1238,445": 2089,
    "684,101": 2090,
    "1423,1824": 2091,
    "117,261": 2092,
    "1697,672": 2093,
    "949,266": 2094,
    "396,1217": 2095,
    "609,384": 2096,
    "1571,1648": 2097,
    "491,377": 2098,
    "1246,456": 2099,
    "1516,101": 2100,
    "675,291": 2101,
    "314,370": 2102,
    "1907,111": 2103,
    "549,1243": 2104,
    "1281,110": 2105,
    "1773,1264": 2106,
    "83,677": 2107,
    "72,348": 2108,
    "769,262": 2109,
    "334,336": 2110,
    "260,1745": 2111,
    "66,1821": 2112,
    "876,971": 2113,
    "1657,274": 2114,
    "2092,2114": 2115,
    "1623,277": 2116,
    "364,116": 2117,
    "853,347": 2118,
    "715,273": 2119,
    "119,374": 2120,
    "1900,1959": 2121,
    "66,328": 2122,
    "272,105": 2123,
    "99,114": 2124,
    "111,259": 2125,
    "102,707": 2126,
    "1924,649": 2127,
    "2127,347": 2128,
    "317,508": 2129,
    "594,1334": 2130,
    "2000,97": 2131,
    "270,584": 2132,
    "1412,261": 2133,
    "347,384": 2134,
    "331,271": 2135,
    "953,370": 2136,
    "891,1153": 2137,
    "504,1473": 2138,
    "32,45": 2139,
    "307,722": 2140,
    "1843,266": 2141,
    "105,368": 2142,
    "309,468": 2143,
    "304,118": 2144,
    "1378,282": 2145,
    "260,642": 2146,
    "1516,261": 2147,
    "302,294": 2148,
    "1380,266": 2149,
    "410,116": 2150,
    "955,115": 2151,
    "1384,100": 2152,
    "1970,519": 2153,
    "333,583": 2154,
    "334,314": 2155,
    "260,2048": 2156,
    "32,1632": 2157,
    "98,829": 2158,
    "39,116": 2159,
    "394,2134": 2160,
    "953,733": 2161,
    "111,102": 2162,
    "119,618": 2163,
    "1246,493": 2164,
    "1588,447": 2165,
    "45,70": 2166,
    "962,2066": 2167,
    "1345,115": 2168,
    "52,472": 2169,
    "284,657": 2170,
    "302,2141": 2171,
    "318,115": 2172,
    "1847,266": 2173,
    "65,507": 2174,
    "509,282": 2175,
    "350,876": 2176,
    "549,1747": 2177,
    "1374,107": 2178,
    "1966,2140": 2179,
    "41,326": 2180,
    "290,1483": 2181,
    "90,1064": 2182,
    "307,115": 2183,
    "46,92": 2184,
    "98,866": 2185,
    "1433,1024": 2186,
    "2186,268": 2187,
    "2146,2087": 2188,
    "112,865": 2189,
    "110,274": 2190,
    "287,111": 2191,
    "1024,276": 2192,
    "455,115": 2193,
    "396,453": 2194,
    "2130,1872": 2195,
    "98,1608": 2196,
    "1509,700": 2197,
    "275,115": 2198,
    "285,105": 2199,
    "111,475": 2200,
    "402,320": 2201,
    "99,262": 2202,
    "514,1430": 2203,
    "274,366": 2204,
    "2052,1193": 2205,
    "357,507": 2206,
    "1656,1729": 2207,
    "2059,268": 2208,
    "272,1989": 2209,
    "1360,763": 2210,
    "316,266": 2211,
    "270,2205": 2212,
    "117,107": 2213,
    "291,384": 2214,
    "399,272": 2215,
    "333,1608": 2216,
    "119,1311": 2217,
    "115,648": 2218,
    "261,664": 2219,
    "1607,116": 2220,
    "121,115": 2221,
    "396,439": 2222,
    "103,115": 2223,
    "879,327": 2224,
    "489,846": 2225,
    "45,115": 2226,
    "448,2131": 2227,
    "276,261": 2228,
    "267,457": 2229,
    "448,410": 2230,
    "1347,1762": 2231,
    "616,1100": 2232,
    "996,115": 2233,
    "279,108": 2234,
    "1934,1193": 2235,
    "1766,1711": 2236,
    "961,275": 2237,
    "2230,897": 2238,
    "2181,538": 2239,
    "448,1898": 2240,
    "989,348": 2241,
    "364,262": 2242,
    "364,103": 2243,
    "278,2217": 2244,
    "1457,410": 2245,
    "495,268": 2246,
    "838,268": 2247,
    "518,1796": 2248,
    "99,121": 2249,
    "404,116": 2250,
    "1406,458": 2251,
    "2037,101": 2252,
    "957,324": 2253,
    "323,107": 2254,
    "65,325": 2255,
    "301,265": 2256,
    "269,265": 2257,
    "901,1488": 2258,
    "1574,1850": 2259,
    "396,259": 2260,
    "634,111": 2261,
    "66,108": 2262,
    "107,276": 2263,
    "784,266": 2264,
    "310,277": 2265,
    "418,1421": 2266,
    "264,1001": 2267,
    "1059,107": 2268,
    "1624,109": 2269,
    "741,2142": 2270,
    "980,291": 2271,
    "103,2176": 2272,
    "2144,2136": 2273,
    "1396,268": 2274,
    "1132,279": 2275,
    "103,422": 2276,
    "489,2204": 2277,
    "471,397": 2278,
    "405,101": 2279,
    "365,1007": 2280,
    "322,115": 2281,
    "359,112": 2282,
    "333,2220": 2283,
    "2079,2276": 2284,
    "310,505": 2285,
    "66,336": 2286,
    "454,378": 2287,
    "70,859": 2288,
    "1556,1932": 2289,
    "348,115": 2290,
    "267,2219": 2291,
    "726,266": 2292,
    "460,536": 2293,
    "1406,291": 2294,
    "260,474": 2295,
    "889,536": 2296,
    "357,108": 2297,
    "102,116": 2298,
    "1981,519": 2299,
    "369,648": 2300,
    "757,445": 2301,
    "366,1123": 2302,
    "84,104": 2303,
    "783,266": 2304,
    "108,299": 2305,
    "354,392": 2306,
    "1446,282": 2307,
    "337,479": 2308,
    "2148,886": 2309,
    "583,104": 2310,
    "562,282": 2311,
    "489,335": 2312,
    "2104,101": 2313,
    "728,445": 2314,
    "1180,274": 2315,
    "480,2237": 2316,
    "284,1632": 2317,
    "716,407": 2318,
    "1588,536": 2319,
    "2310,909": 2320,
    "281,2026": 2321,
    "1203,2287": 2322,
    "983,266": 2323,
    "480,1586": 2324,
    "267,265": 2325,
    "475,340": 2326,
    "305,115": 2327,
    "116,350": 2328,
    "1893,384": 2329,
    "1662,1115": 2330,
    "285,670": 2331,
    "98,1382": 2332,
    "102,271": 2333,
    "400,121": 2334,
    "396,726": 2335,
    "259,268": 2336,
    "303,445": 2337,
    "1359,459": 2338,
    "105,325": 2339,
    "399,2263": 2340,
    "1660,262": 2341,
    "2295,102": 2342,
    "405,111": 2343,
    "2199,1498": 2344,
    "2036,116": 2345,
    "105,111": 2346,
    "2331,101": 2347,
    "698,1815": 2348,
    "1933,787": 2349,
    "72,298": 2350,
    "1087,1696": 2351,
    "45,85": 2352,
    "715,114": 2353,
    "284,1586": 2354,
    "418,2030": 2355,
    "269,2299": 2356,
    "537,261": 2357,
    "83,108": 2358,
    "77,1983": 2359,
    "676,519": 2360,
    "293,98": 2361,
    "329,1985": 2362,
    "418,2245": 2363,
    "71,114": 2364,
    "102,292": 2365,
    "346,97": 2366,
    "2342,567": 2367,
    "304,2128": 2368,
    "960,615": 2369,
    "32,700": 2370,
    "2270,266": 2371,
    "2213,2369": 2372,
    "259,116": 2373,
    "337,298": 2374,
    "854,845": 2375,
    "264,2246": 2376,
    "110,961": 2377,
    "80,296": 2378,
    "2335,684": 2379,
    "1246,262": 2380,
    "101,262": 2381,
    "2188,910": 2382,
    "489,2043": 2383,
    "308,2372": 2384,
    "101,122": 2385,
    "957,2207": 2386,
    "766,495": 2387,
    "748,2328": 2388,
    "589,115": 2389,
    "317,99": 2390,
    "45,1298": 2391,
    "402,2115": 2392,
    "283,652": 2393,
    "1753,266": 2394,
    "80,561": 2395,
    "269,299": 2396,
    "109,439": 2397,
    "1447,323": 2398,
    "87,611": 2399,
    "1973,2172": 2400,
    "1987,903": 2401,
    "116,643": 2402,
    "297,446": 2403,
    "508,277": 2404,
    "263,112": 2405,
    "647,111": 2406,
    "720,285": 2407,
    "359,377": 2408,
    "308,495": 2409,
    "337,271": 2410,
    "269,2347": 2411,
    "1988,2081": 2412,
    "1145,115": 2413,
    "258,542": 2414,
    "308,1944": 2415,
    "349,540": 2416,
    "523,1135": 2417,
    "598,1475": 2418,
    "80,1553": 2419,
    "509,266": 2420,
    "461,115": 2421,
    "317,300": 2422,
    "1347,404": 2423,
    "2375,266": 2424,
    "269,446": 2425,
    "99,108": 2426,
    "357,1275": 2427,
    "2284,2163": 2428,
    "1314,115": 2429,
    "1325,2407": 2430,
    "1876,101": 2431,
    "2412,2249": 2432,
    "474,282": 2433,
    "269,1111": 2434,
    "103,293": 2435,
    "101,103": 2436,
    "438,1311": 2437,
    "1269,787": 2438,
    "529,291": 2439,
    "1875,293": 2440,
    "2361,327": 2441,
    "66,641": 2442,
    "489,2210": 2443,
    "308,517": 2444,
    "71,1377": 2445,
    "919,2311": 2446,
    "346,268": 2447,
    "1104,1862": 2448,
    "80,1166": 2449,
    "302,1177": 2450,
    "1911,293": 2451,
    "97,635": 2452,
    "98,372": 2453,
    "109,2200": 2454,
    "32,1095": 2455,
    "485,630": 2456,
    "2218,1728": 2457,
    "357,678": 2458,
    "514,854": 2459,
    "1393,293": 2460,
    "277,292": 2461,
    "274,2198": 2462,
    "77,1217": 2463,
    "112,104": 2464,
    "259,121": 2465,
    "667,2457": 2466,
    "520,268": 2467,
    "42,44": 2468,
    "45,104": 2469,
    "261,105": 2470,
    "304,99": 2471,
    "639,784": 2472,
    "471,2080": 2473,
    "921,101": 2474,
    "76,831": 2475,
    "108,2125": 2476,
    "953,97": 2477,
    "748,1324": 2478,
    "308,2360": 2479,
    "281,273": 2480,
    "1807,2385": 2481,
    "962,2235": 2482,
    "292,109": 2483,
    "1803,1789": 2484,
    "1372,1820": 2485,
    "281,272": 2486,
    "487,1729": 2487,
    "105,1247": 2488,
    "1827,378": 2489,
    "891,1889": 2490,
    "2480,508": 2491,
    "270,1143": 2492,
    "872,2435": 2493,
    "45,108": 2494,
    "656,276": 2495,
    "489,1436": 2496,
    "1447,392": 2497,
    "539,960": 2498,
    "2345,1862": 2499,
    "1705,2333": 2500,
    "270,1814": 2501,
    "1174,115": 2502,
    "438,466": 2503,
    "2158,266": 2504,
    "53,53": 2505,
    "639,1250": 2506,
    "2491,1494": 2507,
    "350,103": 2508,
    "474,1254": 2509,
    "1888,292": 2510,
    "2117,2495": 2511,
    "1547,115": 2512,
    "266,320": 2513,
    "97,404": 2514,
    "1011,814": 2515,
    "260,110": 2516,
    "2260,910": 2517,
    "533,115": 2518,
    "258,292": 2519,
    "98,1915": 2520,
    "1571,2462": 2521,
    "87,104": 2522,
    "2105,99": 2523,
    "333,2002": 2524,
    "333,108": 2525,
    "119,439": 2526,
    "1765,115": 2527,
    "740,1115": 2528,
    "291,265": 2529,
    "116,425": 2530,
    "616,319": 2531,
    "262,121": 2532,
    "314,121": 2533,
    "114,456": 2534,
    "270,611": 2535,
    "357,2515": 2536,
    "101,298": 2537,
    "323,259": 2538,
    "337,410": 2539,
    "369,1371": 2540,
    "261,282": 2541,
    "1856,1696": 2542,
    "292,1979": 2543,
    "947,114": 2544,
    "1875,1193": 2545,
    "1697,101": 2546,
    "698,2454": 2547,
    "2234,2530": 2548,
    "99,636": 2549,
    "1971,458": 2550,
    "1707,581": 2551,
    "298,293": 2552,
    "2370,1311": 2553,
    "611,318": 2554,
    "66,1915": 2555,
    "2508,275": 2556,
    "45,2504": 2557,
    "1656,293": 2558,
    "281,296": 2559,
    "265,2556": 2560,
    "73,1106": 2561,
    "2300,115": 2562,
    "670,294": 2563,
    "2551,2346": 2564,
    "272,2563": 2565,
    "494,466": 2566,
    "269,2548": 2567,
    "100,111": 2568,
    "1522,295": 2569,
    "263,2221": 2570,
    "947,273": 2571,
    "1978,266": 2572,
    "98,736": 2573,
    "605,1135": 2574,
    "114,377": 2575,
    "369,339": 2576,
    "2042,2453": 2577,
    "263,322": 2578,
    "1139,122": 2579,
    "1444,684": 2580,
    "478,1493": 2581,
    "99,1370": 2582,
    "337,340": 2583,
    "701,1889": 2584,
    "525,111": 2585,
    "258,2529": 2586,
    "284,621": 2587,
    "292,689": 2588,
    "629,1115": 2589,
    "369,607": 2590,
    "1705,2326": 2591,
    "301,420": 2592,
    "2352,112": 2593,
    "715,621": 2594,
    "489,2543": 2595,
    "291,468": 2596,
    "477,121": 2597,
    "79,1299": 2598,
    "441,97": 2599,
    "71,273": 2600,
    "545,2533": 2601,
    "2541,881": 2602,
    "258,2565": 2603,
    "83,99": 2604,
    "106,2040": 2605,
    "263,1657": 2606,
    "337,1582": 2607,
    "487,277": 2608,
    "32,1633": 2609,
    "264,2560": 2610,
    "334,395": 2611,
    "2398,1012": 2612,
    "50,472": 2613,
    "489,105": 2614,
    "83,277": 2615,
    "537,266": 2616,
    "346,517": 2617,
    "1922,527": 2618,
    "117,366": 2619,
    "1385,992": 2620,
    "1491,855": 2621,
    "493,2314": 2622,
    "317,677": 2623,
    "281,2224": 2624,
    "99,383": 2625,
    "284,1139": 2626,
    "109,97": 2627,
    "105,908": 2628,
    "1448,266": 2629,
    "506,327": 2630,
    "2497,447": 2631,
    "267,888": 2632,
    "2008,1796": 2633,
    "268,268": 2634,
    "2587,276": 2635,
    "378,368": 2636,
    "853,1016": 2637,
    "32,2513": 2638,
    "337,294": 2639,
    "925,103": 2640,
    "282,545": 2641,
    "420,1927": 2642,
    "106,292": 2643,
    "1818,261": 2644,
    "2060,1940": 2645,
    "2215,261": 2646,
    "1880,2402": 2647,
    "581,268": 2648,
    "116,99": 2649,
    "2250,527": 2650,
    "1909,97": 2651,
    "269,608": 2652,
    "304,2650": 2653,
    "102,510": 2654,
    "67,2438": 2655,
