{
  "merges": {
    "32,116": 258,
    "104,101": 259,
    "32,97": 260,
    "105,110": 261,
    "258,259": 262,
    "101,114": 263,
    "111,110": 264,
    "114,101": 265,
    "32,115": 266,
    "101,100": 267,
    "32,119": 268
  },
  "id_to_token": {
    "\u0000": 0,
    "\u0001": 1,
    "\u0002": 2,
    "\u0003": 3,
    "\u0004": 4,
    "\u0005": 5,
    "\u0006": 6,
    "\u0007": 7,
    "\b": 8,
    "\t": 9,
    "\n": 10,
    "\u000b": 11,
    "\f": 12,
    "\r": 13,
    "\u000e": 14,
    "\u000f": 15,
    "\u0010": 16,
    "\u0011": 17,
    "\u0012": 18,
    "\u0013": 19,
    "\u0014": 20,
    "\u0015": 21,
    "\u0016": 22,
    "\u0017": 23,
    "\u0018": 24,
    "\u0019": 25,
    "\u001a": 26,
    "\u001b": 27,
    "\u001c": 28,
    "\u001d": 29,
    "\u001e": 30,
    "\u001f": 31,
    " ": 32,
    "!": 33,
    "\"": 34,
    "#": 35,
    "$": 36,
    "%": 37,
    "&": 38,
    "'": 39,
    "(": 40,
    ")": 41,
    "*": 42,
    "+": 43,
    ",": 44,
    "-": 45,
    ".": 46,
    "/": 47,
    "0": 48,
    "1": 49,
    "2": 50,
    "3": 51,
    "4": 52,
    "5": 53,
    "6": 54,
    "7": 55,
    "8": 56,
    "9": 57,
    ":": 58,
    ";": 59,
    "<": 60,
    "=": 61,
    ">": 62,
    "?": 63,
    "@": 64,
    "A": 65,
    "B": 66,
    "C": 67,
    "D": 68,
    "E": 69,
    "F": 70,
    "G": 71,
    "H": 72,
    "I": 73,
    "J": 74,
    "K": 75,
    "L": 76,
    "M": 77,
    "N": 78,
    "O": 79,
    "P": 80,
    "Q": 81,
    "R": 82,
    "S": 83,
    "T": 84,
    "U": 85,
    "V": 86,
    "W": 87,
    "X": 88,
    "Y": 89,
    "Z": 90,
    "[": 91,
    "\\": 92,
    "]": 93,
    "^": 94,
    "_": 95,
    "`": 96,
    "a": 97,
    "b": 98,
    "c": 99,
    "d": 100,
    "e": 101,
    "f": 102,
    "g": 103,
    "h": 104,
    "i": 105,
    "j": 106,
    "k": 107,
    "l": 108,
    "m": 109,
    "n": 110,
    "o": 111,
    "p": 112,
    "q": 113,
    "r": 114,
    "s": 115,
    "t": 116,
    "u": 117,
    "v": 118,
    "w": 119,
    "x": 120,
    "y": 121,
    "z": 122,
    "{": 123,
    "|": 124,
    "}": 125,
    "~": 126,
    "\u007f": 127,
    "80": 128,
    "81": 129,
    "82": 130,
    "83": 131,
    "84": 132,
    "85": 133,
    "86": 134,
    "87": 135,
    "88": 136,
    "89": 137,
    "8a": 138,
    "8b": 139,
    "8c": 140,
    "8d": 141,
    "8e": 142,
    "8f": 143,
    "90": 144,
    "91": 145,
    "92": 146,
    "93": 147,
    "94": 148,
    "95": 149,
    "96": 150,
    "97": 151,
    "98": 152,
    "99": 153,
    "9a": 154,
    "9b": 155,
    "9c": 156,
    "9d": 157,
    "9e": 158,
    "9f": 159,
    "a0": 160,
    "a1": 161,
    "a2": 162,
    "a3": 163,
    "a4": 164,
    "a5": 165,
    "a6": 166,
    "a7": 167,
    "a8": 168,
    "a9": 169,
    "aa": 170,
    "ab": 171,
    "ac": 172,
    "ad": 173,
    "ae": 174,
    "af": 175,
    "b0": 176,
    "b1": 177,
    "b2": 178,
    "b3": 179,
    "b4": 180,
    "b5": 181,
    "b6": 182,
    "b7": 183,
    "b8": 184,
    "b9": 185,
    "ba": 186,
    "bb": 187,
    "bc": 188,
    "bd": 189,
    "be": 190,
    "bf": 191,
    "c0": 192,
    "c1": 193,
    "c2": 194,
    "c3": 195,
    "c4": 196,
    "c5": 197,
    "c6": 198,
    "c7": 199,
    "c8": 200,
    "c9": 201,
    "ca": 202,
    "cb": 203,
    "cc": 204,
    "cd": 205,
    "ce": 206,
    "cf": 207,
    "d0": 208,
    "d1": 209,
    "d2": 210,
    "d3": 211,
    "d4": 212,
    "d5": 213,
    "d6": 214,
    "d7": 215,
    "d8": 216,
    "d9": 217,
    "da": 218,
    "db": 219,
    "dc": 220,
    "dd": 221,
    "de": 222,
    "df": 223,
    "e0": 224,
    "e1": 225,
    "e2": 226,
    "e3": 227,
    "e4": 228,
    "e5": 229,
    "e6": 230,
    "e7": 231,
    "e8": 232,
    "e9": 233,
    "ea": 234,
    "eb": 235,
    "ec": 236,
    "ed": 267,
    "ee": 238,
    "ef": 239,
    "f0": 240,
    "f1": 241,
    "f2": 242,
    "f3": 243,
    "f4": 244,
    "f5": 245,
    "f6": 246,
    "f7": 247,
    "f8": 248,
    "f9": 249,
    "fa": 250,
    "fb": 251,
    "fc": 252,
    "fd": 253,
    "fe": 254,
    "ff": 255,
    "<PAD>": 256,
    "<UNK>": 257,
    " t": 258,
    "he": 259,
    " a": 260,
    "in": 261,
    " the": 262,
    "er": 263,
    "on": 264,
    "re": 265,
    " s": 266,
    " w": 268
  },
  "special_tokens": [
    [
      60,
      80,
      65,
      68,
      62
    ],
    [
      60,
      85,
      78,
      75,
      62
    ]
  ],
  "vocab_size": 10000,
  "context_size": 1024
}