{
  "merges": {
    "105,110": 258,
    "101,114": 259,
    "32,99": 260,
    "97,110": 261,
    "32,115": 262,
    "32,116": 263,
    "111,110": 264,
    "114,101": 265,
    "97,116": 266,
    "101,110": 267,
    "101,115": 268,
    "32,111": 269,
    "97,114": 270,
    "101,100": 271,
    "97,108": 272,
    "32,112": 273,
    "32,98": 274,
    "32,109": 275,
    "105,99": 276,
    "261,100": 277,
    "104,101": 278,
    "105,116": 279,
    "32,277": 280,
    "32,258": 281,
    "32,119": 282,
    "111,114": 283,
    "32,102": 284,
    "105,108": 285,
    "32,97": 286,
    "258,103": 287,
    "114,111": 288,
    "117,116": 289,
    "105,115": 290,
    "105,264": 291,
    "269,102": 292,
    "108,101": 293,
    "97,115": 294,
    "32,100": 295,
    "263,111": 296,
    "111,117": 297,
    "32,101": 298,
    "267,116": 299,
    "32,67": 300,
    "263,278": 301,
    "32,40": 302,
    "101,108": 303,
    "32,83": 304,
    "111,108": 305,
    "103,270": 306,
    "115,112": 307,
    "116,259": 308,
    "112,112": 309,
    "32,84": 310,
    "114,97": 311,
    "32,32": 312,
    "32,108": 313,
    "32,265": 314,
    "101,116": 315,
    "117,110": 316,
    "99,104": 317,
    "260,104": 318,
    "111,109": 319,
    "97,109": 320,
    "99,101": 321,
    "97,107": 322,
    "32,103": 323,
    "117,115": 324,
    "32,80": 325,
    "32,264": 326,
    "262,117": 327,
    "32,65": 328,
    "105,118": 329,
    "297,114": 330,
    "99,116": 331,
    "32,77": 332,
    "32,104": 333,
    "32,66": 334,
    "111,119": 335,
    "262,116": 336,
    "272,116": 337,
    "258,101": 338,
    "111,116": 339,
    "279,104": 340,
    "263,104": 341,
    "282,340": 342,
    "327,306": 343,
    "105,109": 344,
    "284,283": 345,
    "32,118": 346,
    "32,110": 347,
    "100,100": 348,
    "105,103": 349,
    "105,120": 350,
    "108,97": 351,
    "273,101": 352,
    "259,115": 353,
    "266,291": 354,
    "268,101": 355,
    "41,44": 356,
    "263,307": 357,
    "272,108": 358,
    "262,337": 359,
    "103,101": 360,
    "97,100": 361,
    "279,121": 362,
    "274,101": 363,
    "32,82": 364,
    "115,116": 365,
    "103,103": 366,
    "117,108": 367,
    "32,316": 368,
    "97,98": 369,
    "269,114": 370,
    "105,100": 371,
    "46,10": 372,
    "117,114": 373,
    "118,259": 374,
    "111,100": 375,
    "289,308": 376,
    "298,366": 377,
    "260,111": 378,
    "322,101": 379,
    "117,109": 380,
    "278,355": 381,
    "284,108": 382,
    "298,120": 383,
    "109,299": 384,
    "276,107": 385,
    "265,320": 386,
    "105,114": 387,
    "105,102": 388,
    "48,48": 389,
    "118,101": 390,
    "32,68": 391,
    "260,381": 392,
    "274,376": 393,
    "326,291": 394,
    "275,258": 395,
    "266,101": 396,
    "117,112": 397,
    "108,121": 398,
    "32,72": 399,
    "260,264": 400,
    "290,101": 401,
    "265,115": 402,
    "116,115": 403,
    "32,73": 404,
    "108,276": 405,
    "266,259": 406,
    "265,100": 407,
    "32,85": 408,
    "318,111": 409,
    "32,266": 410,
    "260,386": 411,
    "105,112": 412,
    "116,285": 413,
    "285,107": 414,
    "275,350": 415,
    "100,259": 416,
    "104,259": 417,
    "270,116": 418,
    "260,261": 419,
    "97,99": 420,
    "382,330": 421,
    "111,107": 422,
    "352,309": 423,
    "116,111": 424,
    "395,289": 425,
    "276,101": 426,
    "303,108": 427,
    "105,299": 428,
    "368,413": 429,
    "276,272": 430,
    "311,258": 431,
    "32,70": 432,
    "425,268": 433,
    "32,69": 434,
    "282,406": 435,
    "423,259": 436,
    "275,414": 437,
    "32,114": 438,
    "105,101": 439,
    "32,87": 440,
    "97,121": 441,
    "113,117": 442,
    "98,307": 443,
    "105,268": 444,
    "349,104": 445,
    "310,443": 446,
    "266,111": 447,
    "32,293": 448,
    "282,104": 449,
    "268,115": 450,
    "309,271": 451,
    "97,112": 452,
    "328,348": 453,
    "312,312": 454,
    "259,99": 455,
    "266,271": 456,
    "117,265": 457,
    "111,115": 458,
    "111,112": 459,
    "377,115": 460,
    "32,106": 461,
    "283,116": 462,
    "262,97": 463,
    "101,331": 464,
    "274,288": 465,
    "428,115": 466,
    "32,76": 467,
    "117,321": 468,
    "102,102": 469,
    "262,112": 470,
    "295,101": 471,
    "269,122": 472,
    "408,110": 473,
    "273,288": 474,
    "385,267": 475,
    "286,115": 476,
    "262,104": 477,
    "409,451": 478,
    "329,101": 479,
    "275,324": 480,
    "109,264": 481,
    "294,116": 482,
    "260,319": 483,
    "121,115": 484,
    "32,290": 485,
    "329,353": 486,
    "285,351": 487,
    "261,487": 488,
    "114,121": 489,
    "32,78": 490,
    "111,103": 491,
    "261,116": 492,
    "281,424": 493,
    "117,100": 494,
    "346,488": 495,
    "32,278": 496,
    "101,112": 497,
    "92,117": 498,
    "268,116": 499,
    "455,401": 500,
    "260,114": 501,
    "32,71": 502,
    "300,111": 503,
    "285,108": 504,
    "310,278": 505,
    "259,101": 506,
    "269,374": 507,
    "116,104": 508,
    "473,486": 509,
    "322,287": 510,
    "261,115": 511,
    "323,265": 512,
    "49,48": 513,
    "101,109": 514,
    "97,258": 515,
    "119,110": 516,
    "270,100": 517,
    "273,335": 518,
    "114,105": 519,
    "274,510": 520,
    "111,99": 521,
    "41,46": 522,
    "290,116": 523,
    "323,288": 524,
    "275,270": 525,
    "445,116": 526,
    "32,261": 527,
    "108,268": 528,
    "261,321": 529,
    "304,112": 530,
    "300,104": 531,
    "509,362": 532,
    "463,468": 533,
    "99,268": 534,
    "284,288": 535,
    "518,416": 536,
    "404,110": 537,
    "262,101": 538,
    "46,41": 539,
    "334,379": 540,
    "103,315": 541,
    "265,361": 542,
    "32,79": 543,
    "304,116": 544,
    "318,475": 545,
    "383,500": 546,
    "297,112": 547,
    "53,48": 548,
    "101,266": 549,
    "101,102": 550,
    "99,107": 551,
    "289,115": 552,
    "447,268": 553,
    "32,74": 554,
    "282,506": 555,
    "378,422": 556,
    "269,285": 557,
    "283,110": 558,
    "97,360": 559,
    "50,48": 560,
    "111,265": 561,
    "465,516": 562,
    "99,305": 563,
    "286,348": 564,
    "290,104": 565,
    "104,484": 566,
    "281,103": 567,
    "267,100": 568,
    "32,358": 569,
    "567,407": 570,
    "570,466": 571,
    "344,112": 572,
    "32,121": 573,
    "262,547": 574,
    "119,101": 575,
    "316,100": 576,
    "282,294": 577,
    "281,308": 578,
    "105,122": 579,
    "306,338": 580,
    "267,115": 581,
    "431,287": 582,
    "282,427": 583,
    "402,115": 584,
    "97,317": 585,
    "483,112": 586,
    "313,270": 587,
    "294,271": 588,
    "117,98": 589,
    "294,115": 590,
    "331,291": 591,
    "259,121": 592,
    "296,109": 593,
    "107,103": 594,
    "32,75": 595,
    "259,118": 596,
    "274,111": 597,
    "105,97": 598,
    "279,291": 599,
    "313,98": 600,
    "341,266": 601,
    "305,491": 602,
    "116,457": 603,
    "45,258": 604,
    "525,580": 605,
    "461,117": 606,
    "337,104": 607,
    "262,109": 608,
    "117,99": 609,
    "108,108": 610,
    "380,98": 611,
    "587,360": 612,
    "314,115": 613,
    "273,261": 614,
    "273,259": 615,
    "267,321": 616,
    "606,426": 617,
    "415,603": 618,
    "265,110": 619,
    "283,109": 620,
    "309,293": 621,
    "263,582": 622,
    "400,116": 623,
    "273,266": 624,
    "111,289": 625,
    "51,548": 626,
    "111,293": 627,
    "281,99": 628,
    "273,594": 629,
    "97,103": 630,
    "469,464": 631,
    "99,111": 632,
    "512,267": 633,
    "32,306": 634,
    "32,324": 635,
    "535,109": 636,
    "103,104": 637,
    "116,271": 638,
    "32,572": 639,
    "418,384": 640,
    "99,105": 641,
    "270,115": 642,
    "262,405": 643,
    "260,558": 644,
    "32,272": 645,
    "303,121": 646,
    "497,640": 647,
    "108,111": 648,
    "286,265": 649,
    "270,317": 650,
    "634,405": 651,
    "336,494": 652,
    "118,267": 653,
    "369,285": 654,
    "273,339": 655,
    "109,101": 656,
    "274,121": 657,
    "226,128": 658,
    "604,317": 659,
    "375,97": 660,
    "32,288": 661,
    "262,660": 662,
    "332,271": 663,
    "273,439": 664,
    "275,271": 665,
    "324,116": 666,
    "98,259": 667,
    "388,276": 668,
    "112,259": 669,
    "279,101": 670,
    "258,110": 671,
    "32,86": 672,
    "32,107": 673,
    "294,101": 674,
    "270,121": 675,
    "286,100": 676,
    "293,116": 677,
    "49,50": 678,
    "114,258": 679,
    "448,481": 680,
    "354,115": 681,
    "102,620": 682,
    "325,330": 683,
    "305,100": 684,
    "104,288": 685,
    "333,330": 686,
    "367,270": 687,
    "303,592": 688,
    "275,441": 689,
    "608,358": 690,
    "286,309": 691,
    "286,98": 692,
    "262,121": 693,
    "102,259": 694,
    "347,101": 695,
    "260,688": 696,
    "105,265": 697,
    "566,430": 698,
    "98,338": 699,
    "282,101": 700,
    "118,299": 701,
    "358,121": 702,
    "275,101": 703,
    "349,110": 704,
    "541,417": 705,
    "260,397": 706,
    "270,109": 707,
    "296,705": 708,
    "310,104": 709,
    "347,552": 710,
    "297,110": 711,
    "289,101": 712,
    "351,321": 713,
    "97,621": 714,
    "332,350": 715,
    "97,265": 716,
    "41,68": 717,
    "298,631": 718,
    "394,115": 719,
    "338,714": 720,
    "685,319": 721,
    "105,380": 722,
    "524,397": 723,
    "283,107": 724,
    "597,285": 725,
    "105,272": 726,
    "363,550": 727,
    "320,264": 728,
    "335,108": 729,
    "99,264": 730,
    "671,728": 731,
    "97,118": 732,
    "480,721": 733,
    "524,576": 734,
    "111,390": 735,
    "111,375": 736,
    "658,137": 737,
    "454,312": 738,
    "108,258": 739,
    "314,100": 740,
    "260,731": 741,
    "115,104": 742,
    "399,101": 743,
    "314,109": 744,
    "296,112": 745,
    "261,103": 746,
    "118,303": 747,
    "117,101": 748,
    "99,99": 749,
    "77,350": 750,
    "501,611": 751,
    "262,330": 752,
    "49,53": 753,
    "51,48": 754,
    "339,104": 755,
    "369,293": 756,
    "336,387": 757,
    "261,360": 758,
    "267,534": 759,
    "480,99": 760,
    "79,78": 761,
    "273,720": 762,
    "367,116": 763,
    "323,114": 764,
    "297,637": 765,
    "654,279": 766,
    "97,390": 767,
    "283,115": 768,
    "264,101": 769,
    "624,466": 770,
    "294,104": 771,
    "602,121": 772,
    "101,99": 773,
    "544,387": 774,
    "111,365": 775,
    "304,641": 776,
    "273,265": 777,
    "717,647": 778,
    "665,722": 779,
    "281,100": 780,
    "371,101": 781,
    "341,290": 782,
    "32,267": 783,
    "476,115": 784,
    "107,115": 785,
    "311,551": 786,
    "363,266": 787,
    "295,431": 788,
    "110,97": 789,
    "112,116": 790,
    "269,653": 791,
    "274,729": 792,
    "114,117": 793,
    "110,101": 794,
    "104,766": 795,
    "517,105": 796,
    "496,266": 797,
    "412,115": 798,
    "347,339": 799,
    "105,98": 800,
    "275,303": 801,
    "262,111": 802,
    "274,542": 803,
    "99,319": 804,
    "409,563": 805,
    "805,396": 806,
    "440,104": 807,
    "319,699": 808,
    "32,120": 809,
    "291,115": 810,
    "111,264": 811,
    "114,287": 812,
    "258,115": 813,
    "418,276": 814,
    "655,553": 815,
    "269,289": 816,
    "743,607": 817,
    "338,306": 818,
    "322,268": 819,
    "352,99": 820,
    "114,276": 821,
    "259,390": 822,
    "260,379": 823,
    "313,335": 824,
    "276,338": 825,
    "122,267": 826,
    "346,818": 827,
    "194,160": 828,
    "458,101": 829,
    "287,115": 830,
    "262,278": 831,
    "503,422": 832,
    "103,311": 833,
    "679,107": 834,
    "272,115": 835,
    "108,335": 836,
    "298,118": 837,
    "286,331": 838,
    "652,121": 839,
    "593,553": 840,
    "102,308": 841,
    "615,682": 842,
    "264,103": 843,
    "49,51": 844,
    "593,447": 845,
    "590,259": 846,
    "109,259": 847,
    "116,417": 848,
    "266,283": 849,
    "344,101": 850,
    "103,508": 851,
    "32,442": 852,
    "288,112": 853,
    "846,627": 854,
    "269,98": 855,
    "295,290": 856,
    "275,315": 857,
    "295,388": 858,
    "279,115": 859,
    "295,565": 860,
    "110,450": 861,
    "114,444": 862,
    "795,354": 863,
    "751,115": 864,
    "262,704": 865,
    "275,375": 866,
    "333,339": 867,
    "272,361": 868,
    "643,271": 869,
    "692,625": 870,
    "820,511": 871,
    "834,293": 872,
    "267,287": 873,
    "107,101": 874,
    "271,100": 875,
    "744,515": 876,
    "260,270": 877,
    "274,315": 878,
    "50,53": 879,
    "339,116": 880,
    "295,489": 881,
    "97,331": 882,
    "260,786": 883,
    "628,265": 884,
    "639,288": 885,
    "875,270": 886,
    "420,107": 887,
    "283,100": 888,
    "663,825": 889,
    "41,40": 890,
    "311,331": 891,
    "363,511": 892,
    "105,261": 893,
    "764,456": 894,
    "858,694": 895,
    "318,285": 896,
    "116,581": 897,
    "482,101": 898,
    "101,541": 899,
    "32,311": 900,
    "623,288": 901,
    "503,305": 902,
    "668,492": 903,
    "111,118": 904,
    "833,109": 905,
    "269,108": 906,
    "575,315": 907,
    "297,115": 908,
    "324,104": 909,
    "438,426": 910,
    "801,638": 911,
    "112,101": 912,
    "276,104": 913,
    "477,462": 914,
    "111,305": 915,
    "369,528": 916,
    "273,698": 917,
    "260,289": 918,
    "619,851": 919,
    "293,121": 920,
    "316,591": 921,
    "265,101": 922,
    "116,272": 923,
    "262,596": 924,
    "265,266": 925,
    "102,116": 926,
    "523,529": 927,
    "336,385": 928,
    "865,903": 929,
    "402,104": 930,
    "760,293": 931,
    "531,886": 932,
    "319,101": 933,
    "365,279": 934,
    "286,841": 935,
    "275,549": 936,
    "114,349": 937,
    "449,670": 938,
    "400,100": 939,
    "294,264": 940,
    "264,789": 941,
    "373,287": 942,
    "838,329": 943,
    "276,115": 944,
    "298,585": 945,
    "941,401": 946,
    "346,899": 947,
    "99,687": 948,
    "263,101": 949,
    "575,267": 950,
    "347,289": 951,
    "97,285": 952,
    "295,105": 953,
    "318,798": 954,
    "270,105": 955,
    "111,307": 956,
    "117,469": 957,
    "333,767": 958,
    "274,108": 959,
    "279,272": 960,
    "701,291": 961,
    "535,826": 962,
    "878,950": 963,
    "102,108": 964,
    "297,108": 965,
    "114,264": 966,
    "262,107": 967,
    "689,946": 968,
    "116,101": 969,
    "364,101": 970,
    "295,268": 971,
    "876,287": 972,
    "111,98": 973,
    "118,268": 974,
    "325,713": 975,
    "69,83": 976,
    "115,101": 977,
    "97,120": 978,
    "367,403": 979,
    "328,110": 980,
    "336,919": 981,
    "266,479": 982,
    "496,607": 983,
    "313,526": 984,
    "273,452": 985,
    "317,915": 986,
    "267,416": 987,
    "333,272": 988,
    "32,89": 989,
    "49,54": 990,
    "776,759": 991,
    "914,873": 992,
    "341,267": 993,
    "480,116": 994,
    "260,648": 995,
    "284,387": 996,
    "474,905": 997,
    "32,279": 998,
    "283,403": 999,
    "300,264": 1000,
    "563,105": 1001,
    "420,264": 1002,
    "556,271": 1003,
    "439,119": 1004,
    "299,259": 1005,
    "579,271": 1006,
    "293,331": 1007,
    "434,120": 1008,
    "32,91": 1009,
    "937,259": 1010,
    "788,271": 1011,
    "314,112": 1012,
    "273,814": 1013,
    "262,315": 1014,
    "99,1001": 1015,
    "347,111": 1016,
    "32,61": 1017,
    "512,588": 1018,
    "105,271": 1019,
    "686,115": 1020,
    "108,494": 1021,
    "333,121": 1022,
    "39,115": 1023,
    "97,102": 1024,
    "365,492": 1025,
    "284,921": 1026,
    "642,920": 1027,
    "101,119": 1028,
    "116,291": 1029,
    "101,120": 1030,
    "275,561": 1031,
    "97,407": 1032,
    "471,99": 1033,
    "314,108": 1034,
    "273,1027": 1035,
    "560,49": 1036,
    "260,796": 1037,
    "373,103": 1038,
    "290,115": 1039,
    "99,271": 1040,
    "333,445": 1041,
    "709,290": 1042,
    "116,116": 1043,
    "117,348": 1044,
    "314,307": 1045,
    "41,10": 1046,
    "295,942": 1047,
    "273,402": 1048,
    "118,1004": 1049,
    "263,850": 1050,
    "730,289": 1051,
    "994,517": 1052,
    "327,98": 1053,
    "909,271": 1054,
    "956,960": 1055,
    "32,397": 1056,
    "311,119": 1057,
    "1044,287": 1058,
    "400,115": 1059,
    "284,930": 1060,
    "355,650": 1061,
    "501,1054": 1062,
    "452,121": 1063,
    "323,311": 1064,
    "73,110": 1065,
    "284,258": 1066,
    "73,761": 1067,
    "274,1002": 1068,
    "503,374": 1069,
    "272,484": 1070,
    "273,108": 1071,
    "115,115": 1072,
    "279,861": 1073,
    "263,898": 1074,
    "378,1051": 1075,
    "530,872": 1076,
    "329,371": 1077,
    "285,101": 1078,
    "117,272": 1079,
    "573,101": 1080,
    "566,105": 1081,
    "521,105": 1082,
    "114,272": 1083,
    "877,288": 1084,
    "711,100": 1085,
    "934,712": 1086,
    "384,115": 1087,
    "308,110": 1088,
    "787,267": 1089,
    "114,290": 1090,
    "112,811": 1091,
    "83,65": 1092,
    "104,320": 1093,
    "613,927": 1094,
    "348,271": 1095,
    "114,261": 1096,
    "538,940": 1097,
    "265,1095": 1098,
    "849,121": 1099,
    "383,116": 1100,
    "628,1021": 1101,
    "326,101": 1102,
    "262,99": 1103,
    "313,111": 1104,
    "901,108": 1105,
    "282,272": 1106,
    "373,110": 1107,
    "365,514": 1108,
    "352,261": 1109,
    "477,1098": 1110,
    "802,926": 1111,
    "807,412": 1112,
    "739,430": 1113,
    "102,561": 1114,
    "364,1061": 1115,
    "267,271": 1116,
    "314,102": 1117,
    "703,294": 1118,
    "746,268": 1119,
    "263,925": 1120,
    "725,287": 1121,
    "661,610": 1122,
    "733,115": 1123,
    "1013,412": 1124,
    "266,268": 1125,
    "1057,667": 1126,
    "333,320": 1127,
    "261,261": 1128,
    "284,1073": 1129,
    "738,32": 1130,
    "295,111": 1131,
    "375,121": 1132,
    "262,344": 1133,
    "304,822": 1134,
    "333,294": 1135,
    "45,98": 1136,
    "259,109": 1137,
    "378,305": 1138,
    "965,100": 1139,
    "118,271": 1140,
    "109,414": 1141,
    "282,504": 1142,
    "112,104": 1143,
    "274,379": 1144,
    "266,115": 1145,
    "275,261": 1146,
    "276,271": 1147,
    "718,115": 1148,
    "286,749": 1149,
    "369,305": 1150,
    "274,294": 1151,
    "269,848": 1152,
    "117,288": 1153,
    "514,735": 1154,
    "194,177": 1155,
    "273,1058": 1156,
    "274,265": 1157,
    "363,1114": 1158,
    "358,335": 1159,
    "263,119": 1160,
    "354,272": 1161,
    "370,758": 1162,
    "643,268": 1163,
    "284,266": 1164,
    "274,289": 1165,
    "419,115": 1166,
    "52,53": 1167,
    "314,863": 1168,
    "943,362": 1169,
    "578,499": 1170,
    "408,1092": 1171,
    "300,379": 1172,
    "272,117": 1173,
    "635,287": 1174,
    "67,104": 1175,
    "742,697": 1176,
    "793,279": 1177,
    "842,529": 1178,
    "440,283": 1179,
    "465,508": 1180,
    "441,259": 1181,
    "378,374": 1182,
    "268,261": 1183,
    "383,112": 1184,
    "110,552": 1185,
    "99,299": 1186,
    "664,534": 1187,
    "364,1154": 1188,
    "988,102": 1189,
    "49,49": 1190,
    "67,808": 1191,
    "707,1183": 1192,
    "69,84": 1193,
    "45,112": 1194,
    "301,387": 1195,
    "325,289": 1196,
    "534,308": 1197,
    "449,913": 1198,
    "399,1055": 1199,
    "440,101": 1200,
    "52,48": 1201,
    "536,271": 1202,
    "579,101": 1203,
    "295,1147": 1204,
    "111,285": 1205,
    "105,442": 1206,
    "885,390": 1207,
    "1197,1176": 1208,
    "584,287": 1209,
    "597,120": 1210,
    "465,1015": 1211,
    "261,403": 1212,
    "277,319": 1213,
    "831,610": 1214,
    "106,464": 1215,
    "1084,403": 1216,
    "114,397": 1217,
    "300,808": 1218,
    "109,258": 1219,
    "281,118": 1220,
    "260,854": 1221,
    "101,107": 1222,
    "100,115": 1223,
    "369,315": 1224,
    "332,819": 1225,
    "1179,1208": 1226,
    "102,405": 1227,
    "784,450": 1228,
    "351,551": 1229,
    "346,955": 1230,
    "103,261": 1231,
    "325,1192": 1232,
    "652,444": 1233,
    "263,987": 1234,
    "900,290": 1235,
    "663,430": 1236,
    "323,267": 1237,
    "602,430": 1238,
    "747,459": 1239,
    "656,103": 1240,
    "274,880": 1241,
    "448,747": 1242,
    "100,117": 1243,
    "324,559": 1244,
    "334,549": 1245,
    "67,84": 1246,
    "288,516": 1247,
    "293,111": 1248,
    "519,98": 1249,
    "266,287": 1250,
    "32,45": 1251,
    "380,112": 1252,
    "314,1049": 1253,
    "391,647": 1254,
    "269,1248": 1255,
    "635,101": 1256,
    "321,790": 1257,
    "107,97": 1258,
    "966,276": 1259,
    "55,53": 1260,
    "274,755": 1261,
    "282,724": 1262,
    "305,836": 1263,
    "45,115": 1264,
    "341,261": 1265,
    "691,528": 1266,
    "1022,669": 1267,
    "263,519": 1268,
    "336,114": 1269,
    "578,961": 1270,
    "272,101": 1271,
    "262,442": 1272,
    "266,646": 1273,
    "736,528": 1274,
    "693,1108": 1275,
    "267,99": 1276,
    "317,261": 1277,
    "318,259": 1278,
    "286,99": 1279,
    "951,1240": 1280,
    "272,362": 1281,
    "757,812": 1282,
    "1235,813": 1283,
    "100,609": 1284,
    "99,450": 1285,
    "273,330": 1286,
    "1008,500": 1287,
    "322,271": 1288,
    "1070,290": 1289,
    "266,276": 1290,
    "530,542": 1291,
    "327,114": 1292,
    "373,112": 1293,
    "458,115": 1294,
    "85,83": 1295,
    "434,110": 1296,
    "693,1217": 1297,
    "266,457": 1298,
    "264,115": 1299,
    "295,401": 1300,
    "1120,384": 1301,
    "996,365": 1302,
    "314,103": 1303,
    "341,259": 1304,
    "883,353": 1305,
    "79,68": 1306,
    "351,118": 1307,
    "294,268": 1308,
    "49,52": 1309,
    "112,261": 1310,
    "560,50": 1311,
    "305,108": 1312,
    "304,868": 1313,
    "84,83": 1314,
    "325,698": 1315,
    "309,287": 1316,
    "896,105": 1317,
    "274,1128": 1318,
    "303,115": 1319,
    "313,843": 1320,
    "104,121": 1321,
    "320,101": 1322,
    "336,1126": 1323,
    "1117,1010": 1324,
    "438,1213": 1325,
    "98,1038": 1326,
    "115,111": 1327,
    "260,684": 1328,
    "304,986": 1329,
    "1109,289": 1330,
    "266,97": 1331,
    "632,97": 1332,
    "300,761": 1333,
    "105,407": 1334,
    "347,1274": 1335,
    "780,1077": 1336,
    "477,335": 1337,
    "108,277": 1338,
    "635,271": 1339,
    "329,268": 1340,
    "274,1229": 1341,
    "831,315": 1342,
    "363,267": 1343,
    "501,666": 1344,
    "378,1332": 1345,
    "361,101": 1346,
    "262,907": 1347,
    "104,677": 1348,
    "334,105": 1349,
    "371,616": 1350,
    "263,121": 1351,
    "300,305": 1352,
    "723,115": 1353,
    "367,354": 1354,
    "294,948": 1355,
    "336,277": 1356,
    "270,107": 1357,
    "393,1141": 1358,
    "1160,111": 1359,
    "258,105": 1360,
    "273,351": 1361,
    "995,974": 1362,
    "310,417": 1363,
    "67,76": 1364,
    "519,271": 1365,
    "279,444": 1366,
    "97,119": 1367,
    "285,677": 1368,
    "300,854": 1369,
    "449,105": 1370,
    "101,374": 1371,
    "287,259": 1372,
    "449,627": 1373,
    "537,1086": 1374,
    "300,319": 1375,
    "290,99": 1376,
    "284,1263": 1377,
    "530,462": 1378,
    "455,290": 1379,
    "410,1348": 1380,
    "344,299": 1381,
    "427,111": 1382,
    "114,599": 1383,
    "474,118": 1384,
    "32,388": 1385,
    "404,923": 1386,
    "115,117": 1387,
    "339,417": 1388,
    "286,289": 1389,
    "274,1132": 1390,
    "1227,116": 1391,
    "109,1159": 1392,
    "115,121": 1393,
    "341,355": 1394,
    "300,1005": 1395,
    "284,504": 1396,
    "959,568": 1397,
    "103,110": 1398,
    "295,1209": 1399,
    "49,57": 1400,
    "32,568": 1401,
    "389,48": 1402,
    "423,353": 1403,
    "328,666": 1404,
    "260,589": 1405,
    "1293,829": 1406,
    "264,105": 1407,
    "303,116": 1408,
    "260,108": 1409,
    "947,756": 1410,
    "304,104": 1411,
    "258,271": 1412,
    "274,105": 1413,
    "99,259": 1414,
    "105,303": 1415,
    "347,264": 1416,
    "32,90": 1417,
    "122,122": 1418,
    "258,97": 1419,
    "85,76": 1420,
    "32,81": 1421,
    "290,109": 1422,
    "290,107": 1423,
    "262,868": 1424,
    "259,973": 1425,
    "358,115": 1426,
    "368,416": 1427,
    "463,1244": 1428,
    "706,115": 1429,
    "816,804": 1430,
    "332,1193": 1431,
    "967,1368": 1432,
    "325,439": 1433,
    "467,315": 1434,
    "365,650": 1435,
    "420,763": 1436,
    "336,396": 1437,
    "383,1379": 1438,
    "258,268": 1439,
    "1425,276": 1440,
    "654,362": 1441,
    "883,259": 1442,
    "49,56": 1443,
    "586,1032": 1444,
    "103,265": 1445,
    "538,271": 1446,
    "276,268": 1447,
    "195,169": 1448,
    "278,266": 1449,
    "279,268": 1450,
    "1224,268": 1451,
    "283,287": 1452,
    "117,637": 1453,
    "48,53": 1454,
    "644,1435": 1455,
    "364,976": 1456,
    "464,291": 1457,
    "262,108": 1458,
    "320,112": 1459,
    "111,755": 1460,
    "895,299": 1461,
    "784,1082": 1462,
    "645,1327": 1463,
    "1364,1295": 1464,
    "452,116": 1465,
    "1464,1067": 1466,
    "300,261": 1467,
    "298,108": 1468,
    "117,402": 1469,
    "263,499": 1470,
    "857,1150": 1471,
    "1333,1466": 1472,
    "282,707": 1473,
    "72,1306": 1474,
    "295,697": 1475,
    "273,887": 1476,
    "691,288": 1477,
    "260,305": 1478,
    "556,439": 1479,
    "295,765": 1480,
    "1431,1474": 1481,
    "317,110": 1482,
    "67,111": 1483,
    "314,365": 1484,
    "325,288": 1485,
    "1456,1420": 1486,
    "1436,121": 1487,
    "776,616": 1488,
    "388,101": 1489,
    "310,459": 1490,
    "329,646": 1491,
    "273,584": 1492,
    "1318,294": 1493,
    "1486,1314": 1494,
    "279,479": 1495,
    "105,111": 1496,
    "101,271": 1497,
    "335,1371": 1498,
    "608,1460": 1499,
    "334,101": 1500,
    "304,596": 1501,
    "273,775": 1502,
    "371,259": 1503,
    "525,742": 1504,
    "1504,1392": 1505,
    "556,287": 1506,
    "284,1307": 1507,
    "613,979": 1508,
    "285,362": 1509,
    "323,1372": 1510,
    "281,1025": 1511,
    "273,713": 1512,
    "341,385": 1513,
    "1100,891": 1514,
    "266,308": 1515,
    "526,398": 1516,
    "1404,1083": 1517,
    "449,267": 1518,
    "978,344": 1519,
    "884,588": 1520,
    "78,68": 1521,
    "109,112": 1522,
    "632,374": 1523,
    "276,288": 1524,
    "300,289": 1525,
    "274,267": 1526,
    "41,83": 1527,
    "904,1355": 1528,
    "45,102": 1529,
    "260,373": 1530,
    "1029,272": 1531,
    "897,362": 1532,
    "116,515": 1533,
    "341,288": 1534,
    "533,1310": 1535,
    "101,785": 1536,
    "265,108": 1537,
    "1396,287": 1538,
    "364,1312": 1539,
    "50,52": 1540,
    "104,375": 1541,
    "103,288": 1542,
    "1106,1185": 1543,
    "1481,83": 1544,
    "328,108": 1545,
    "1300,674": 1546,
    "695,271": 1547,
    "313,279": 1548,
    "964,330": 1549,
    "260,1113": 1550,
    "924,287": 1551,
    "645,481": 1552,
    "471,1239": 1553,
    "388,116": 1554,
    "369,98": 1555,
    "947,916": 1556,
    "273,270": 1557,
    "1326,259": 1558,
    "294,403": 1559,
    "318,1119": 1560,
    "319,267": 1561,
    "1231,111": 1562,
    "470,462": 1563,
    "837,1173": 1564,
    "519,1258": 1565,
    "51,53": 1566,
    "314,99": 1567,
    "434,112": 1568,
    "273,459": 1569,
    "985,259": 1570,
    "371,299": 1571,
    "1389,104": 1572,
    "308,109": 1573,
    "700,526": 1574,
    "268,403": 1575,
    "1241,319": 1576,
    "383,669": 1577,
    "57,53": 1578,
    "334,114": 1579,
    "461,1382": 1580,
    "260,716": 1581,
    "308,115": 1582,
    "101,650": 1583,
    "341,258": 1584,
    "395,1040": 1585,
    "459,1531": 1586,
    "985,1565": 1587,
    "427,335": 1588,
    "286,103": 1589,
    "335,110": 1590,
    "929,398": 1591,
    "361,97": 1592,
    "980,100": 1593,
    "1555,559": 1594,
    "1393,317": 1595,
    "1133,847": 1596,
    "400,102": 1597,
    "51,1260": 1598,
    "313,1181": 1599,
    "259,103": 1600,
    "99,114": 1601,
    "288,1072": 1602,
    "591,115": 1603,
    "262,1203": 1604,
    "303,102": 1605,
    "108,565": 1606,
    "279,271": 1607,
    "295,1331": 1608,
    "1276,121": 1609,
    "1483,422": 1610,
    "265,1562": 1611,
    "1438,268": 1612,
    "269,1611": 1613,
    "613,1583": 1614,
    "452,101": 1615,
    "269,749": 1616,
    "295,769": 1617,
    "1124,1212": 1618,
    "102,367": 1619,
    "304,97": 1620,
    "1157,1559": 1621,
    "1000,1391": 1622,
    "970,863": 1623,
    "559,384": 1624,
    "1534,1453": 1625,
    "259,272": 1626,
    "773,668": 1627,
    "107,258": 1628,
    "599,115": 1629,
    "1517,598": 1630,
    "98,376": 1631,
    "1097,287": 1632,
    "1437,384": 1633,
    "449,1450": 1634,
    "300,796": 1635,
    "98,293": 1636,
    "573,305": 1637,
    "391,431": 1638,
    "264,100": 1639,
    "332,111": 1640,
    "284,882": 1641,
    "461,270": 1642,
    "984,398": 1643,
    "39,83": 1644,
    "105,283": 1645,
    "1505,115": 1646,
    "735,384": 1647,
    "263,916": 1648,
    "273,724": 1649,
    "274,427": 1650,
    "454,32": 1651,
    "441,115": 1652,
    "114,572": 1653,
    "109,271": 1654,
    "1648,1091": 1655,
    "281,116": 1656,
    "260,452": 1657,
    "352,303": 1658,
    "438,1423": 1659,
    "286,1440": 1660,
    "108,568": 1661,
    "1387,306": 1662,
    "531,504": 1663,
    "116,276": 1664,
    "323,108": 1665,
    "476,781": 1666,
    "300,459": 1667,
    "284,1177": 1668,
    "111,258": 1669,
    "596,271": 1670,
    "676,1465": 1671,
    "263,114": 1672,
    "499,349": 1673,
    "585,268": 1674,
    "648,375": 1675,
    "842,271": 1676,
    "310,111": 1677,
    "1351,912": 1678,
    "80,265": 1679,
    "924,830": 1680,
    "54,48": 1681,
    "1137,261": 1682,
    "656,272": 1683,
    "304,101": 1684,
    "32,270": 1685,
    "1526,550": 1686,
    "275,1519": 1687,
    "1380,268": 1688,
    "610,271": 1689,
    "290,271": 1690,
    "609,317": 1691,
    "97,324": 1692,
    "1064,1093": 1693,
    "290,291": 1694,
    "82,79": 1695,
    "260,283": 1696,
    "1043,105": 1697,
    "1691,1360": 1698,
    "837,1350": 1699,
    "108,351": 1700,
    "67,386": 1701,
    "313,344": 1702,
    "1370,451": 1703,
    "371,268": 1704,
    "673,110": 1705,
    "116,267": 1706,
    "1111,1116": 1707,
    "420,270": 1708,
    "1462,456": 1709,
    "1568,589": 1710,
    "273,891": 1711,
    "101,366": 1712,
    "286,344": 1713,
    "971,1334": 1714,
    "711,116": 1715,
    "667,489": 1716,
    "112,115": 1717,
    "278,1697": 1718,
    "716,1700": 1719,
    "275,339": 1720,
    "852,1281": 1721,
    "49,55": 1722,
    "45,116": 1723,
    "1418,1719": 1724,
    "1323,862": 1725,
    "275,264": 1726,
    "316,317": 1727,
    "116,293": 1728,
    "824,259": 1729,
    "564,599": 1730,
    "857,1541": 1731,
    "331,271": 1732,
    "273,104": 1733,
    "530,999": 1734,
    "1066,646": 1735,
    "299,398": 1736,
    "490,101": 1737,
    "483,98": 1738,
    "434,1284": 1739,
    "122,101": 1740,
    "281,115": 1741,
    "99,293": 1742,
    "1572,768": 1743,
    "325,101": 1744,
    "263,283": 1745,
    "121,293": 1746,
    "304,119": 1747,
    "630,1718": 1748,
    "1136,588": 1749,
    "483,699": 1750,
    "99,108": 1751,
    "477,1139": 1752,
    "449,1078": 1753,
    "32,122": 1754,
    "586,315": 1755,
    "313,1206": 1756,
    "1708,1407": 1757,
    "270,98": 1758,
    "619,116": 1759,
    "329,267": 1760,
    "117,103": 1761,
    "289,291": 1762,
    "1080,642": 1763,
    "341,506": 1764,
    "527,1289": 1765,
    "1304,1063": 1766,
    "51,879": 1767,
    "292,102": 1768,
    "45,100": 1769,
    "380,261": 1770,
    "802,121": 1771,
    "285,100": 1772,
    "949,294": 1773,
    "695,1153": 1774,
    "1501,268": 1775,
    "1773,1091": 1776,
    "293,360": 1777,
    "262,822": 1778,
    "299,265": 1779,
    "1220,1673": 1780,
    "581,271": 1781,
    "1048,299": 1782,
    "108,271": 1783,
    "448,116": 1784,
    "103,267": 1785,
    "1101,271": 1786,
    "467,101": 1787,
    "470,999": 1788,
    "273,289": 1789,
    "282,1561": 1790,
    "794,121": 1791,
    "282,338": 1792,
    "1012,462": 1793,
    "265,442": 1794,
    "368,100": 1795,
    "286,360": 1796,
    "276,702": 1797,
    "352,294": 1798,
    "611,259": 1799,
    "32,426": 1800,
    "1194,1406": 1801,
    "326,398": 1802,
    "274,1675": 1803,
    "65,84": 1804,
    "32,60": 1805,
    "906,479": 1806,
    "383,320": 1807,
    "432,1487": 1808,
    "117,407": 1809,
    "324,115": 1810,
    "1640,1724": 1811,
    "345,109": 1812,
    "295,771": 1813,
    "305,396": 1814,
    "684,267": 1815,
    "32,1571": 1816,
    "584,291": 1817,
    "45,442": 1818,
    "1080,482": 1819,
    "469,276": 1820,
    "1053,1215": 1821,
    "364,268": 1822,
    "953,1451": 1823,
    "1739,354": 1824,
    "800,293": 1825,
    "275,775": 1826,
    "273,258": 1827,
    "388,102": 1828,
    "284,736": 1829,
    "32,344": 1830,
    "283,765": 1831,
    "318,504": 1832,
    "521,1814": 1833,
    "399,1498": 1834,
    "1386,893": 1835,
    "1252,1628": 1836,
    "490,1028": 1837,
    "1430,268": 1838,
    "333,361": 1839,
    "316,103": 1840,
    "317,475": 1841,
    "995,390": 1842,
    "299,726": 1843,
    "300,82": 1844,
    "262,450": 1845,
    "1242,115": 1846,
    "315,97": 1847,
    "1637,785": 1848,
    "1756,371": 1849,
    "325,1081": 1850,
    "906,1340": 1851,
    "1458,1516": 1852,
    "309,462": 1853,
    "268,362": 1854,
    "676,979": 1855,
    "293,120": 1856,
    "538,374": 1857,
    "262,1605": 1858,
    "730,100": 1859,
    "502,1682": 1860,
    "884,674": 1861,
    "275,515": 1862,
    "897,291": 1863,
    "260,1594": 1864,
    "110,526": 1865,
    "296,923": 1866,
    "623,515": 1867,
    "275,590": 1868,
    "273,482": 1869,
    "32,1155": 1870,
    "310,101": 1871,
    "325,265": 1872,
    "265,674": 1873,
    "341,922": 1874,
    "258,100": 1875,
    "700,1536": 1876,
    "61,737": 1877,
    "1601,412": 1878,
    "274,1515": 1879,
    "481,103": 1880,
    "273,1081": 1881,
    "283,121": 1882,
    "564,584": 1883,
    "46,356": 1884,
    "939,1781": 1885,
    "52,389": 1886,
    "327,317": 1887,
    "101,322": 1888,
    "65,67": 1889,
    "116,853": 1890,
    "117,835": 1891,
    "737,1877": 1892,
    "327,366": 1893,
    "106,373": 1894,
    "470,872": 1895,
    "281,964": 1896,
    "349,417": 1897,
    "1376,117": 1898,
    "1278,862": 1899,
    "32,271": 1900,
    "364,111": 1901,
    "855,115": 1902,
    "507,1865": 1903,
    "65,114": 1904,
    "847,276": 1905,
    "639,462": 1906,
    "396,103": 1907,
    "299,115": 1908,
    "315,121": 1909,
    "895,759": 1910,
    "303,266": 1911,
    "412,101": 1912,
    "388,1019": 1913,
    "382,819": 1914,
    "105,375": 1915,
    "97,387": 1916,
    "105,107": 1917,
    "415,271": 1918,
    "490,289": 1919,
    "101,121": 1920,
    "109,324": 1921,
    "323,1815": 1922,
    "114,344": 1923,
    "1745,413": 1924,
    "888,287": 1925,
    "284,1794": 1926,
    "365,114": 1927,
    "301,121": 1928,
    "275,763": 1929,
    "874,121": 1930,
    "97,367": 1931,
    "471,112": 1932,
    "701,810": 1933,
    "259,396": 1934,
    "1818,418": 1935,
    "399,549": 1936,
    "389,49": 1937,
    "474,1285": 1938,
    "101,101": 1939,
    "1037,1528": 1940,
    "1542,576": 1941,
    "319,315": 1942,
    "300,73": 1943,
    "514,105": 1944,
    "296,1316": 1945,
    "573,1588": 1946,
    "624,428": 1947,
    "953,315": 1948,
    "114,526": 1949,
    "109,568": 1950,
    "1831,398": 1951,
    "274,630": 1952,
    "543,114": 1953,
    "732,268": 1954,
    "459,293": 1955,
    "1127,1558": 1956,
    "438,396": 1957,
    "1151,285": 1958,
    "41,67": 1959,
    "32,113": 1960,
    "1524,119": 1961,
    "275,379": 1962,
    "470,542": 1963,
    "273,458": 1964,
    "1352,1777": 1965,
    "323,1911": 1966,
    "286,109": 1967,
    "45,79": 1968,
    "69,82": 1969,
    "477,1653": 1970,
    "1104,1024": 1971,
    "364,550": 1972,
    "527,121": 1973,
    "97,321": 1974,
    "328,114": 1975,
    "369,283": 1976,
    "1007,1259": 1977,
    "866,303": 1978,
    "832,444": 1979,
    "1033,351": 1980,
    "420,111": 1981,
    "448,1043": 1982,
    "906,416": 1983,
    "996,109": 1984,
    "521,107": 1985,
    "431,271": 1986,
    "314,804": 1987,
    "1960,116": 1988,
    "109,316": 1989,
    "470,1748": 1990,
    "589,405": 1991,
    "1361,121": 1992,
    "104,732": 1993,
    "1324,849": 1994,
    "341,1951": 1995,
    "1982,468": 1996,
    "273,418": 1997,
    "470,1497": 1998,
    "667,862": 1999,
    "703,261": 2000,
    "333,277": 2001,
    "32,34": 2002,
    "1336,1891": 2003,
    "121,110": 2004,
    "1961,767": 2005,
    "615,1915": 2006,
    "543,110": 2007,
    "676,118": 2008,
    "578,1933": 2009,
    "110,287": 2010,
    "732,121": 2011,
    "449,111": 2012,
    "1037,420": 2013,
    "260,293": 2014,
    "777,112": 2015,
    "1267,1890": 2016,
    "266,104": 2017,
    "258,272": 2018,
    "807,267": 2019,
    "888,353": 2020,
    "286,1880": 2021,
    "329,271": 2022,
    "391,412": 2023,
    "274,1426": 2024,
    "1679,1449": 2025,
    "609,271": 2026,
    "286,118": 2027,
    "346,592": 2028,
    "105,266": 2029,
    "1325,1006": 2030,
    "311,122": 2031,
    "632,422": 2032,
    "333,1897": 2033,
    "66,1247": 2034,
    "263,311": 2035,
    "367,456": 2036,
    "334,1661": 2037,
    "275,1757": 2038,
    "121,101": 2039,
    "118,272": 2040,
    "1268,272": 2041,
    "300,1090": 2042,
    "259,116": 2043,
    "383,1257": 2044,
    "769,121": 2045,
    "298,653": 2046,
    "410,116": 2047,
    "1146,1624": 2048,
    "259,110": 2049,
    "573,297": 2050,
    "50,389": 2051,
    "1337,271": 2052,
    "300,386": 2053,
    "531,1419": 2054,
    "105,908": 2055,
    "73,83": 2056,
    "278,109": 2057,
    "703,1277": 2058,
    "1641,768": 2059,
    "1415,100": 2060,
    "93,46": 2061,
    "303,390": 2062,
    "258,585": 2063,
    "1972,1010": 2064,
    "325,339": 2065,
    "109,261": 2066,
    "311,98": 2067,
    "272,268": 2068,
    "700,1222": 2069,
    "531,475": 2070,
    "297,407": 2071,
    "1026,272": 2072,
    "387,1099": 2073,
    "32,859": 2074,
    "284,514": 2075,
    "328,610": 2076,
    "346,305": 2077,
    "408,75": 2078,
    "1278,489": 2079,
    "271,117": 2080,
    "325,259": 2081,
    "97,105": 2082,
    "108,294": 2083,
    "1377,287": 2084,
    "116,287": 2085,
    "901,1689": 2086,
    "281,1894": 2087,
    "474,102": 2088,
    "2064,396": 2089,
    "400,1025": 2090,
    "780,276": 2091,
    "424,563": 2092,
    "288,109": 2093,
    "336,266": 2094,
    "101,294": 2095,
    "373,272": 2096,
    "32,499": 2097,
    "1472,83": 2098,
    "1149,1925": 2099,
    "1467,1592": 2100,
    "1104,361": 2101,
    "1987,1950": 2102,
    "391,105": 2103,
    "291,272": 2104,
    "432,684": 2105,
    "1405,268": 2106,
    "313,1489": 2107,
    "951,1383": 2108,
    "48,49": 2109,
    "1537,456": 2110,
    "121,1949": 2111,
    "367,108": 2112,
    "115,99": 2113,
    "269,1145": 2114,
    "793,331": 2115,
    "290,403": 2116,
    "1667,2111": 2117,
    "273,515": 2118,
    "305,390": 2119,
    "373,529": 2120,
    "1471,276": 2121,
    "625,104": 2122,
    "1268,835": 2123,
    "262,933": 2124,
    "382,2071": 2125,
    "1388,1063": 2126,
    "880,559": 2127,
    "388,638": 2128,
    "334,542": 2129,
    "1664,293": 2130,
    "65,76": 2131,
    "391,101": 2132,
    "309,259": 2133,
    "112,268": 2134,
    "1552,1223": 2135,
    "50,49": 2136,
    "1657,420": 2137,
    "32,814": 2138,
    "474,969": 2139,
    "496,2011": 2140,
    "311,121": 2141,
    "1966,258": 2142,
    "37,41": 2143,
    "73,78": 2144,
    "50,51": 2145,
    "45,365": 2146,
    "298,442": 2147,
    "32,43": 2148,
    "117,371": 2149,
    "373,848": 2150,
    "286,621": 2151,
    "1904,2130": 2152,
    "1976,1099": 2153,
    "367,481": 2154,
    "304,344": 2155,
    "293,591": 2156,
    "1059,1503": 2157,
    "32,44": 2158,
    "1754,1698": 2159,
    "263,514": 2160,
    "99,1249": 2161,
    "1492,457": 2162,
    "1737,1153": 2163,
    "284,1085": 2164,
    "327,1853": 2165,
    "303,338": 2166,
    "295,1365": 2167,
    "512,406": 2168,
    "928,115": 2169,
    "458,290": 2170,
    "1122,115": 2171,
    "304,121": 2172,
    "1457,353": 2173,
    "305,268": 2174,
    "415,287": 2175,
    "329,259": 2176,
    "107,287": 2177,
    "46,2080": 2178,
    "275,771": 2179,
    "2031,285": 2180,
    "434,1977": 2181,
    "497,270": 2182,
    "508,115": 2183,
    "496,418": 2184,
    "718,479": 2185,
    "111,407": 2186,
    "933,1277": 2187,
    "300,1779": 2188,
    "387,264": 2189,
    "318,1259": 2190,
    "373,1930": 2191,
    "300,1113": 2192,
    "554,427": 2193,
    "116,121": 2194,
    "896,100": 2195,
    "518,259": 2196,
    "1045,464": 2197,
    "105,259": 2198,
    "1175,475": 2199,
    "855,1854": 2200,
    "334,2180": 2201,
    "432,283": 2202,
    "1527,986": 2203,
    "85,1521": 2204,
    "117,551": 2205,
    "269,790": 2206,
    "1921,948": 2207,
    "281,1532": 2208,
    "949,1482": 2209,
    "83,116": 2210,
    "1182,271": 2211,
    "1672,511": 2212,
    "352,1955": 2213,
    "1893,499": 2214,
    "118,287": 2215,
    "75,71": 2216,
    "474,2092": 2217,
    "2154,675": 2218,
    "1867,259": 2219,
    "619,317": 2220,
    "388,121": 2221,
    "120,344": 2222,
    "263,344": 2223,
    "284,922": 2224,
    "440,340": 2225,
    "334,812": 2226,
    "2062,1847": 2227,
    "579,354": 2228,
    "114,758": 2229,
    "364,426": 2230,
    "301,109": 2231,
    "300,381": 2232,
    "1375,112": 2233,
    "50,56": 2234,
    "116,264": 2235,
    "1821,115": 2236,
    "334,1889": 2237,
    "1397,271": 2238,
    "2137,362": 2239,
    "2216,1695": 2240,
    "2240,2204": 2241,
    "109,270": 2242,
    "2237,2241": 2243,
    "420,308": 2244,
    "502,311": 2245,
    "1243,702": 2246,
    "326,424": 2247,
    "856,99": 2248,
    "274,1898": 2249,
    "270,112": 2250,
    "73,67": 2251,
    "103,268": 2252,
    "341,475": 2253,
    "264,977": 2254,
    "73,86": 2255,
    "329,1694": 2256,
    "1445,588": 2257,
    "195,173": 2258,
    "307,464": 2259,
    "82,84": 2260,
    "305,1140": 2261,
    "2042,632": 2262,
    "866,1934": 2263,
    "1597,2173": 2264,
    "195,179": 2265,
    "273,898": 2266,
    "586,677": 2267,
    "508,459": 2268,
    "874,677": 2269,
    "336,957": 2270,
    "1228,271": 2271,
    "1275,1290": 2272,
    "1118,457": 2273,
    "258,354": 2274,
    "260,2127": 2275,
    "1363,101": 2276,
    "109,339": 2277,
    "530,811": 2278,
    "273,407": 2279,
    "856,2020": 2280,
    "482,276": 2281,
    "693,110": 2282,
    "1336,1079": 2283,
    "1669,116": 2284,
    "1548,1728": 2285,
    "1066,100": 2286,
    "1658,271": 2287,
    "1101,287": 2288,
    "530,515": 2289,
    "391,853": 2290,
    "836,259": 2291,
    "195,161": 2292,
    "100,101": 2293,
    "2090,398": 2294,
    "270,258": 2295,
    "69,1246": 2296,
    "97,402": 2297,
    "709,355": 2298,
    "470,1627": 2299,
    "562,271": 2300,
    "1145,397": 2301,
    "50,50": 2302,
    "673,315": 2303,
    "939,117": 2304,
    "83,112": 2305,
    "885,1140": 2306,
    "275,1647": 2307,
    "334,1247": 2308,
    "590,268": 2309,
    "273,1836": 2310,
    "121,656": 2311,
    "328,1905": 2312,
    "304,99": 2313,
    "101,261": 2314,
    "404,116": 2315,
    "111,120": 2316,
    "661,576": 2317,
    "318,270": 2318,
    "1902,1670": 2319,
    "77,68": 2320,
    "273,1381": 2321,
    "273,511": 2322,
    "295,303": 2323,
    "275,267": 2324,
    "266,1683": 2325,
    "273,353": 2326,
    "122,97": 2327,
    "336,1828": 2328,
    "347,1799": 2329,
    "461,666": 2330,
    "939,1629": 2331,
    "856,115": 2332,
    "470,811": 2333,
    "328,100": 2334,
    "575,1222": 2335,
    "99,386": 2336,
    "295,523": 2337,
    "41,58": 2338,
    "77,1408": 2339,
    "262,781": 2340,
    "496,361": 2341,
    "315,276": 2342,
    "73,84": 2343,
    "370,1119": 2344,
    "32,38": 2345,
    "997,115": 2346,
    "783,765": 2347,
    "314,442": 2348,
    "45,265": 2349,
    "260,2301": 2350,
    "274,297": 2351,
    "448,482": 2352,
    "2269,272": 2353,
    "672,2227": 2354,
    "521,324": 2355,
    "504,264": 2356,
    "333,2045": 2357,
    "332,261": 2358,
    "363,1993": 2359,
    "438,266": 2360,
    "97,106": 2361,
    "1606,271": 2362,
    "263,1107": 2363,
    "97,117": 2364,
    "284,1205": 2365,
    "263,1981": 2366,
    "300,270": 2367,
    "321,2022": 2368,
    "760,528": 2369,
    "336,1888": 2370,
    "491,267": 2371,
    "1896,117": 2372,
    "1269,1907": 2373,
    "284,489": 2374,
    "1600,121": 2375,
    "108,259": 2376,
    "318,758": 2377,
    "620,272": 2378,
    "2351,2356": 2379,
    "295,297": 2380,
    "655,1843": 2381,
    "641,272": 2382,
    "400,1186": 2383,
    "1118,1809": 2384,
    "260,272": 2385,
    "448,1954": 2386,
    "1296,103": 2387,
    "262,836": 2388,
    "1655,115": 2389,
    "298,1007": 2390,
    "261,99": 2391,
    "115,287": 2392,
    "313,450": 2393,
    "286,112": 2394,
    "1906,492": 2395,
    "681,104": 2396,
    "109,790": 2397,
    "262,2128": 2398,
    "1476,559": 2399,
    "114,279": 2400,
    "293,118": 2401,
    "1857,272": 2402,
    "501,261": 2403,
    "1923,675": 2404,
    "272,121": 2405,
    "329,362": 2406,
    "282,978": 2407,
    "855,355": 2408,
    "283,456": 2409,
    "260,1005": 2410,
    "341,829": 2411,
    "273,1595": 2412,
    "598,1398": 2413,
    "85,110": 2414,
    "98,101": 2415,
    "1919,1383": 2416,
    "274,588": 2417,
    "295,504": 2418,
    "318,316": 2419,
    "260,121": 2420,
    "477,2250": 2421,
    "332,315": 2422,
    "2032,271": 2423,
    "346,115": 2424,
    "1712,115": 2425,
    "274,441": 2426,
    "66,74": 2427,
    "1569,1354": 2428,
    "1793,271": 2429,
    "45,65": 2430,
    "1553,384": 2431,
    "2318,2244": 2432,
    "281,317": 2433,
    "49,389": 2434,
    "1033,265": 2435,
    "325,266": 2436,
    "101,497": 2437,
    "971,704": 2438,
    "312,32": 2439,
    "260,1139": 2440,
    "645,1088": 2441,
    "341,1367": 2442,
    "270,398": 2443,
    "260,277": 2444,
    "497,568": 2445,
    "288,1015": 2446,
    "119,104": 2447,
    "1507,1452": 2448,
    "432,2220": 2449,
    "2160,669": 2450,
    "284,338": 2451,
    "2270,287": 2452,
    "334,376": 2453,
    "97,104": 2454,
    "740,117": 2455,
    "342,625": 2456,
    "1059,523": 2457,
    "471,102": 2458,
    "655,447": 2459,
    "2222,1273": 2460,
    "119,724": 2461,
    "2427,2296": 2462,
    "318,499": 2463,
    "1034,2396": 2464,
    "285,121": 2465,
    "695,119": 2466,
    "282,278": 2467,
    "262,2182": 2468,
    "1475,1603": 2469,
    "2155,847": 2470,
    "1045,1299": 2471,
    "269,120": 2472,
    "639,882": 2473,
    "274,358": 2474,
    "55,48": 2475,
    "1523,271": 2476,
    "739,276": 2477,
    "481,1927": 2478,
    "393,271": 2479,
    "623,258": 2480,
    "262,1704": 2481,
    "50,54": 2482,
    "114,354": 2483,
    "83,69": 2484,
    "273,385": 2485,
    "1269,798": 2486,
    "471,2478": 2487,
    "371,1791": 2488,
    "260,609": 2489,
    "274,264": 2490,
    "341,2311": 2491,
    "270,290": 2492,
    "2179,271": 2493,
    "51,54": 2494,
    "273,116": 2495,
    "2016,1321": 2496,
    "324,291": 2497,
    "470,2063": 2498,
    "425,101": 2499,
    "47,45": 2500,
    "295,1652": 2501,
    "119,441": 2502,
    "332,264": 2503,
    "98,542": 2504,
    "310,1107": 2505,
    "108,450": 2506,
    "45,67": 2507,
    "46,44": 2508,
    "643,101": 2509,
    "1980,265": 2510,
    "342,258": 2511,
    "306,100": 2512,
    "78,84": 2513,
    "2015,1032": 2514,
    "837,452": 2515,
    "346,272": 2516,
    "1760,450": 2517,
    "45,261": 2518,
    "332,1408": 2519,
    "1738,1412": 2520,
    "72,549": 2521,
    "983,121": 2522,
    "2223,268": 2523,
    "1845,810": 2524,
    "108,100": 2525,
    "1384,781": 2526,
    "45,109": 2527,
    "45,99": 2528,
    "2462,2255": 2529,
    "313,1294": 2530,
    "420,121": 2531,
    "2450,1298": 2532,
    "538,1859": 2533,
    "1151,2166": 2534,
    "1401,2120": 2535,
    "543,2529": 2536,
    "1878,1029": 2537,
    "709,267": 2538,
    "105,311": 2539,
    "364,497": 2540,
    "305,276": 2541,
    "2515,2409": 2542,
    "285,105": 2543,
    "740,2026": 2544,
    "1530,1759": 2545,
    "1654,105": 2546,
    "114,396": 2547,
    "45,1573": 2548,
    "409,1717": 2549,
    "895,616": 2550,
    "286,631": 2551,
    "2304,1732": 2552,
    "1045,2254": 2553,
    "1324,396": 2554,
    "275,957": 2555,
    "105,267": 2556,
    "368,115": 2557,
    "284,1028": 2558,
    "391,111": 2559,
    "118,2189": 2560,
    "317,397": 2561,
    "353,116": 2562,
    "45,2110": 2563,
    "105,874": 2564,
    "41,1065": 2565,
    "501,279": 2566,
    "673,2488": 2567,
    "537,100": 2568,
    "2397,319": 2569,
    "417,489": 2570,
    "109,279": 2571,
    "2442,271": 2572,
    "2195,619": 2573,
    "109,115": 2574,
    "108,491": 2575,
    "491,311": 2576,
    "313,441": 2577,
    "272,529": 2578,
    "2197,1491": 2579,
    "46,804": 2580,
    "308,1219": 2581,
    "473,1607": 2582,
    "2029,821": 2583,
    "300,272": 2584,
    "490,111": 2585,
    "259,98": 2586,
    "1323,489": 2587,
    "352,322": 2588,
    "1320,259": 2589,
    "378,1398": 2590,
    "325,104": 2591,
    "521,726": 2592,
    "98,358": 2593,
    "325,65": 2594,
    "1034,456": 2595,
    "800,1509": 2596,
    "105,772": 2597,
    "661,293": 2598,
    "313,482": 2599,
    "50,55": 2600,
    "271,276": 2601,
    "1356,517": 2602,
    "258,111": 2603,
    "502,288": 2604,
    "673,794": 2605,
    "1106,2177": 2606,
    "1292,103": 2607,
    "1924,2083": 2608,
    "438,316": 2609,
    "279,494": 2610,
    "1711,426": 2611,
    "114,277": 2612,
    "259,287": 2613,
    "624,104": 2614,
    "110,565": 2615,
    "45,397": 2616,
    "276,116": 2617,
    "368,2476": 2618,
    "611,353": 2619,
    "32,46": 2620,
    "260,427": 2621,
    "2312,261": 2622,
    "1118,1469": 2623,
    "208,184": 2624,
    "661,482": 2625,
    "304,315": 2626,
    "108,492": 2627,
    "1557,1322": 2628,
    "1774,2207": 2629,
    "2303,2561": 2630,
    "1267,1863": 2631,
    "37,44": 2632,
    "1548,259": 2633,
    "110,271": 2634,
    "263,589": 2635,
    "263,418": 2636,
    "293,384": 2637,
    "47,106": 2638,
    "573,330": 2639,
    "279,122": 2640,
    "556,444": 2641,
    "1384,371": 2642,
    "857,97": 2643,
    "2004,320": 2644,
    "298,1820": 2645,
    "310,119": 2646,
    "1573,338": 2647,
    "1692,101": 2648,
    "284,330": 2649,
    "56,48": 2650,
    "415,259": 2651,
    "448,1024": 2652,
    "295,2413": 2653,
    "2046,398": 2654,
    "295,371": 2655,
    "2286,830": 2656,
    "471,2647": 2657,
    "1671,681": 2658,
    "323,2149": 2659,
    "32,492": 2660,
    "352,1674": 2661,
    "262,1944": 2662,
    "282,417": 2663,
    "281,682": 2664,
    "544,494": 2665,
    "108,287": 2666,
