{
  "merges": {
    "32,116": 258,
    "104,101": 259,
    "32,97": 260,
    "105,110": 261,
    "258,259": 262,
    "101,114": 263,
    "111,110": 264,
    "114,101": 265,
    "32,115": 266,
    "101,100": 267,
    "32,119": 268,
    "32,111": 269,
    "110,100": 270,
    "97,116": 271,
    "111,114": 272,
    "101,110": 273,
    "105,116": 274,
    "32,99": 275,
    "32,102": 276,
    "101,115": 277,
    "105,115": 278,
    "97,114": 279,
    "32,98": 280,
    "269,102": 281,
    "97,110": 282,
    "32,261": 283,
    "97,108": 284,
    "261,103": 285,
    "32,112": 286,
    "97,115": 287,
    "260,270": 288,
    "258,111": 289,
    "105,99": 290,
    "114,111": 291,
    "32,109": 292,
    "32,100": 293,
    "32,104": 294,
    "105,264": 295,
    "108,101": 296,
    "111,117": 297,
    "32,84": 298,
    "32,265": 299,
    "105,108": 300,
    "32,83": 301,
    "273,116": 302,
    "32,65": 303,
    "258,104": 304,
    "115,116": 305,
    "101,108": 306,
    "32,108": 307,
    "111,109": 308,
    "97,109": 309,
    "32,101": 310,
    "32,67": 311,
    "32,110": 312,
    "97,100": 313,
    "97,99": 314,
    "268,287": 315,
    "32,77": 316,
    "32,264": 317,
    "101,99": 318,
    "108,121": 319,
    "117,114": 320,
    "101,116": 321,
    "32,66": 322,
    "32,103": 323,
    "298,259": 324,
    "111,108": 325,
    "105,100": 326,
    "105,109": 327,
    "105,114": 328,
    "105,103": 329,
    "276,272": 330,
    "105,118": 331,
    "111,116": 332,
    "32,73": 333,
    "116,263": 334,
    "117,116": 335,
    "111,119": 336,
    "260,115": 337,
    "117,115": 338,
    "32,72": 339,
    "274,104": 340,
    "97,121": 341,
    "266,116": 342,
    "39,115": 343,
    "118,263": 344,
    "259,114": 345,
    "271,295": 346,
    "280,101": 347,
    "268,340": 348,
    "32,80": 349,
    "304,271": 350,
    "99,101": 351,
    "117,110": 352,
    "32,64": 353,
    "32,82": 354,
    "101,109": 355,
    "32,68": 356,
    "99,104": 357,
    "116,104": 358,
    "268,104": 359,
    "280,121": 360,
    "97,270": 361,
    "117,108": 362,
    "32,70": 363,
    "32,87": 364,
    "260,108": 365,
    "32,278": 366,
    "275,264": 367,
    "263,115": 368,
    "32,40": 369,
    "260,116": 370,
    "32,71": 371,
    "99,116": 372,
    "32,76": 373,
    "32,78": 374,
    "97,261": 375,
    "111,115": 376,
    "49,57": 377,
    "260,110": 378,
    "32,274": 379,
    "97,103": 380,
    "291,109": 381,
    "32,259": 382,
    "97,118": 383,
    "117,109": 384,
    "277,116": 385,
    "32,74": 386,
    "32,114": 387,
    "48,48": 388,
    "278,116": 389,
    "114,105": 390,
    "111,100": 391,
    "32,69": 392,
    "276,381": 393,
    "275,308": 394,
    "294,278": 395,
    "97,112": 396,
    "32,79": 397,
    "32,118": 398,
    "111,112": 399,
    "286,291": 400,
    "105,102": 401,
    "108,100": 402,
    "263,101": 403,
    "111,265": 404,
    "117,112": 405,
    "300,108": 406,
    "329,104": 407,
    "105,277": 408,
    "101,119": 409,
    "265,115": 410,
    "268,403": 411,
    "97,107": 412,
    "272,116": 413,
    "279,100": 414,
    "293,101": 415,
    "98,263": 416,
    "290,104": 417,
    "266,101": 418,
    "284,108": 419,
    "333,110": 420,
    "271,101": 421,
    "279,116": 422,
    "97,98": 423,
    "282,116": 424,
    "113,117": 425,
    "117,100": 426,
    "310,120": 427,
    "264,103": 428,
    "111,99": 429,
    "103,104": 430,
    "269,114": 431,
    "271,267": 432,
    "101,279": 433,
    "309,101": 434,
    "286,108": 435,
    "274,121": 436,
    "266,104": 437,
    "275,104": 438,
    "277,115": 439,
    "331,101": 440,
    "105,112": 441,
    "32,75": 442,
    "294,313": 443,
    "32,85": 444,
    "115,101": 445,
    "318,116": 446,
    "32,226": 447,
    "314,107": 448,
    "297,114": 449,
    "265,100": 450,
    "32,107": 451,
    "32,34": 452,
    "266,117": 453,
    "287,116": 454,
    "117,270": 455,
    "103,101": 456,
    "105,282": 457,
    "359,417": 458,
    "260,265": 459,
    "447,128": 460,
    "301,116": 461,
    "32,296": 462,
    "109,302": 463,
    "32,61": 464,
    "111,118": 465,
    "105,284": 466,
    "312,332": 467,
    "266,112": 468,
    "32,121": 469,
    "407,116": 470,
    "111,305": 471,
    "306,108": 472,
    "258,114": 473,
    "105,97": 474,
    "272,100": 475,
    "116,345": 476,
    "114,274": 477,
    "279,121": 478,
    "261,101": 479,
    "117,305": 480,
    "297,110": 481,
    "383,101": 482,
    "112,116": 483,
    "290,284": 484,
    "32,352": 485,
    "50,388": 486,
    "328,305": 487,
    "99,99": 488,
    "112,112": 489,
    "311,104": 490,
    "102,334": 491,
    "283,99": 492,
    "50,48": 493,
    "297,402": 494,
    "280,335": 495,
    "278,104": 496,
    "297,115": 497,
    "394,112": 498,
    "116,101": 499,
    "32,86": 500,
    "115,111": 501,
    "114,97": 502,
    "295,115": 503,
    "102,102": 504,
    "276,487": 505,
    "326,101": 506,
    "32,291": 507,
    "119,111": 508,
    "117,265": 509,
    "117,98": 510,
    "379,115": 511,
    "268,259": 512,
    "367,116": 513,
    "260,114": 514,
    "262,328": 515,
    "111,107": 516,
    "105,101": 517,
    "287,115": 518,
    "275,108": 519,
    "32,345": 520,
    "297,116": 521,
    "329,110": 522,
    "111,103": 523,
    "272,109": 524,
    "117,101": 525,
    "283,116": 526,
    "271,263": 527,
    "308,101": 528,
    "272,107": 529,
    "260,98": 530,
    "264,100": 531,
    "299,115": 532,
    "105,265": 533,
    "259,100": 534,
    "365,501": 535,
    "460,147": 536,
    "32,338": 537,
    "112,263": 538,
    "339,101": 539,
    "336,110": 540,
    "260,100": 541,
    "380,101": 542,
    "49,56": 543,
    "109,263": 544,
    "327,101": 545,
    "282,115": 546,
    "108,336": 547,
    "114,121": 548,
    "284,319": 549,
    "353,46": 550,
    "112,108": 551,
    "114,117": 552,
    "294,482": 553,
    "317,101": 554,
    "286,263": 555,
    "100,117": 556,
    "258,508": 557,
    "116,267": 558,
    "299,99": 559,
    "359,111": 560,
    "105,296": 561,
    "266,99": 562,
    "117,430": 563,
    "105,122": 564,
    "298,104": 565,
    "265,101": 566,
    "112,413": 567,
    "273,351": 568,
    "353,44": 569,
    "116,115": 570,
    "347,273": 571,
    "320,285": 572,
    "282,351": 573,
    "260,103": 574,
    "297,430": 575,
    "274,295": 576,
    "294,287": 577,
    "108,361": 578,
    "306,121": 579,
    "114,290": 580,
    "280,318": 581,
    "32,273": 582,
    "304,278": 583,
    "269,344": 584,
    "469,433": 585,
    "293,278": 586,
    "493,49": 587,
    "346,115": 588,
    "108,426": 589,
    "260,489": 590,
    "32,106": 591,
    "303,108": 592,
    "286,422": 593,
    "97,265": 594,
    "281,102": 595,
    "266,263": 596,
    "355,416": 597,
    "314,104": 598,
    "260,491": 599,
    "297,270": 600,
    "290,101": 601,
    "32,405": 602,
    "107,101": 603,
    "34,46": 604,
    "272,121": 605,
    "435,341": 606,
    "313,101": 607,
    "111,344": 608,
    "293,277": 609,
    "269,476": 610,
    "262,121": 611,
    "292,282": 612,
    "372,295": 613,
    "269,335": 614,
    "279,107": 615,
    "105,98": 616,
    "314,101": 617,
    "119,110": 618,
    "258,101": 619,
    "362,116": 620,
    "314,116": 621,
    "333,116": 622,
    "97,300": 623,
    "410,115": 624,
    "119,101": 625,
    "282,103": 626,
    "32,327": 627,
    "320,110": 628,
    "99,267": 629,
    "492,589": 630,
    "41,44": 631,
    "258,545": 632,
    "273,115": 633,
    "274,101": 634,
    "268,494": 635,
    "526,111": 636,
    "101,121": 637,
    "444,110": 638,
    "286,265": 639,
    "111,261": 640,
    "101,112": 641,
    "268,101": 642,
    "261,100": 643,
    "310,118": 644,
    "271,277": 645,
    "109,282": 646,
    "294,327": 647,
    "108,277": 648,
    "32,89": 649,
    "287,267": 650,
    "481,116": 651,
    "370,116": 652,
    "119,414": 653,
    "265,110": 654,
    "312,101": 655,
    "397,110": 656,
    "274,267": 657,
    "105,267": 658,
    "423,296": 659,
    "291,563": 660,
    "266,259": 661,
    "309,112": 662,
    "394,109": 663,
    "111,121": 664,
    "272,115": 665,
    "101,270": 666,
    "365,108": 667,
    "292,404": 668,
    "325,100": 669,
    "264,115": 670,
    "287,101": 671,
    "334,110": 672,
    "263,267": 673,
    "102,524": 674,
    "285,115": 675,
    "268,529": 676,
    "41,46": 677,
    "302,115": 678,
    "111,391": 679,
    "99,277": 680,
    "280,321": 681,
    "264,101": 682,
    "278,115": 683,
    "300,100": 684,
    "323,434": 685,
    "97,119": 686,
    "266,318": 687,
    "271,116": 688,
    "312,409": 689,
    "118,306": 690,
    "102,263": 691,
    "118,105": 692,
    "102,116": 693,
    "290,107": 694,
    "390,98": 695,
    "261,284": 696,
    "119,341": 697,
    "376,101": 698,
    "512,110": 699,
    "323,291": 700,
    "412,101": 701,
    "265,271": 702,
    "34,44": 703,
    "276,101": 704,
    "300,109": 705,
    "367,115": 706,
    "272,358": 707,
    "303,114": 708,
    "510,108": 709,
    "455,263": 710,
    "293,318": 711,
    "303,110": 712,
    "118,267": 713,
    "301,101": 714,
    "299,109": 715,
    "275,302": 716,
    "103,282": 717,
    "625,273": 718,
    "97,338": 719,
    "293,572": 720,
    "262,109": 721,
    "332,104": 722,
    "325,547": 723,
    "574,375": 724,
    "291,112": 725,
    "117,103": 726,
    "287,264": 727,
    "317,319": 728,
    "292,471": 729,
    "310,279": 730,
    "105,120": 731,
    "304,282": 732,
    "303,115": 733,
    "316,279": 734,
    "286,114": 735,
    "451,110": 736,
    "116,264": 737,
    "681,718": 738,
    "530,521": 739,
    "104,441": 740,
    "266,405": 741,
    "377,57": 742,
    "102,404": 743,
    "111,98": 744,
    "304,566": 745,
    "32,710": 746,
    "282,107": 747,
    "275,282": 748,
    "283,334": 749,
    "438,279": 750,
    "104,110": 751,
    "266,428": 752,
    "114,264": 753,
    "307,527": 754,
    "271,104": 755,
    "118,101": 756,
    "272,110": 757,
    "297,358": 758,
    "275,325": 759,
    "290,116": 760,
    "346,284": 761,
    "400,556": 762,
    "276,705": 763,
    "299,116": 764,
    "292,101": 765,
    "111,516": 766,
    "304,660": 767,
    "309,277": 768,
    "260,372": 769,
    "296,372": 770,
    "312,384": 771,
    "299,296": 772,
    "299,108": 773,
    "276,108": 774,
    "32,425": 775,
    "260,488": 776,
    "310,270": 777,
    "284,115": 778,
    "374,409": 779,
    "266,111": 780,
    "544,290": 781,
    "101,344": 782,
    "272,402": 783,
    "97,326": 784,
    "392,110": 785,
    "49,48": 786,
    "388,48": 787,
    "280,117": 788,
    "359,561": 789,
    "273,263": 790,
    "271,285": 791,
    "334,115": 792,
    "429,107": 793,
    "303,781": 794,
    "299,103": 795,
    "331,267": 796,
    "286,376": 797,
    "362,279": 798,
    "114,284": 799,
    "293,341": 800,
    "337,115": 801,
    "278,534": 802,
    "311,308": 803,
    "286,101": 804,
    "111,325": 805,
    "259,115": 806,
    "687,531": 807,
    "512,265": 808,
    "453,98": 809,
    "292,607": 810,
    "559,475": 811,
    "330,109": 812,
    "32,344": 813,
    "268,477": 814,
    "310,112": 815,
    "110,285": 816,
    "276,723": 817,
    "373,101": 818,
    "415,102": 819,
    "98,384": 820,
    "278,295": 821,
    "418,727": 822,
    "49,55": 823,
    "453,357": 824,
    "468,318": 825,
    "276,449": 826,
    "32,46": 827,
    "105,306": 828,
    "266,528": 829,
    "259,110": 830,
    "323,114": 831,
    "391,101": 832,
    "112,104": 833,
    "291,455": 834,
    "347,743": 835,
    "260,99": 836,
    "283,100": 837,
    "290,115": 838,
    "375,267": 839,
    "262,265": 840,
    "307,279": 841,
    "291,115": 842,
    "260,109": 843,
    "292,338": 844,
    "585,115": 845,
    "117,99": 846,
    "105,603": 847,
    "105,111": 848,
    "275,419": 849,
    "537,267": 850,
    "117,284": 851,
    "292,264": 852,
    "292,465": 853,
    "386,111": 854,
    "286,709": 855,
    "32,47": 856,
    "303,116": 857,
    "115,264": 858,
    "336,782": 859,
    "300,121": 860,
    "326,302": 861,
    "815,278": 862,
    "565,278": 863,
    "294,407": 864,
    "365,820": 865,
    "301,112": 866,
    "108,267": 867,
    "282,101": 868,
    "266,121": 869,
    "401,290": 870,
    "284,101": 871,
    "320,121": 872,
    "347,285": 873,
    "619,309": 874,
    "312,111": 875,
    "354,101": 876,
    "266,320": 877,
    "266,321": 878,
    "301,104": 879,
    "427,112": 880,
    "307,429": 881,
    "32,302": 882,
    "116,273": 883,
    "293,111": 884,
    "724,305": 885,
    "97,328": 886,
    "97,106": 887,
    "262,110": 888,
    "261,277": 889,
    "332,345": 890,
    "280,108": 891,
    "49,53": 892,
    "105,497": 893,
    "105,107": 894,
    "771,416": 895,
    "276,600": 896,
    "279,115": 897,
    "690,399": 898,
    "336,263": 899,
    "271,345": 900,
    "49,50": 901,
    "49,54": 902,
    "418,344": 903,
    "286,410": 904,
    "261,351": 905,
    "278,267": 906,
    "750,314": 907,
    "283,118": 908,
    "112,273": 909,
    "638,657": 910,
    "275,111": 911,
    "322,477": 912,
    "280,722": 913,
    "268,472": 914,
    "280,114": 915,
    "106,446": 916,
    "282,99": 917,
    "719,101": 918,
    "282,121": 919,
    "581,434": 920,
    "541,100": 921,
    "437,336": 922,
    "105,263": 923,
    "263,109": 924,
    "274,115": 925,
    "328,100": 926,
    "101,107": 927,
    "266,285": 928,
    "117,357": 929,
    "377,52": 930,
    "280,448": 931,
    "114,309": 932,
    "331,368": 933,
    "278,101": 934,
    "303,491": 935,
    "299,112": 936,
    "437,441": 937,
    "306,102": 938,
    "299,351": 939,
    "274,408": 940,
    "105,450": 941,
    "596,408": 942,
    "460,148": 943,
    "108,108": 944,
    "292,375": 945,
    "355,302": 946,
    "828,100": 947,
    "377,56": 948,
    "401,101": 949,
    "462,313": 950,
    "275,396": 951,
    "111,416": 952,
    "292,321": 953,
    "296,121": 954,
    "630,285": 955,
    "292,261": 956,
    "282,110": 957,
    "105,321": 958,
    "260,328": 959,
    "862,832": 960,
    "117,410": 961,
    "271,440": 962,
    "286,325": 963,
    "310,109": 964,
    "499,270": 965,
    "785,103": 966,
    "102,362": 967,
    "275,265": 968,
    "97,122": 969,
    "287,104": 970,
    "307,428": 971,
    "608,110": 972,
    "116,285": 973,
    "331,263": 974,
    "118,273": 975,
    "275,279": 976,
    "293,326": 977,
    "112,114": 978,
    "325,523": 979,
    "333,270": 980,
    "97,450": 981,
    "612,121": 982,
    "415,898": 983,
    "358,575": 984,
    "533,372": 985,
    "273,110": 986,
    "323,111": 987,
    "555,674": 988,
    "342,426": 989,
    "854,751": 990,
    "261,115": 991,
    "280,291": 992,
    "275,494": 993,
    "903,284": 994,
    "301,259": 995,
    "268,279": 996,
    "736,540": 997,
    "473,546": 998,
    "431,329": 999,
    "97,104": 1000,
    "100,263": 1001,
    "513,261": 1002,
    "292,406": 1003,
    "355,98": 1004,
    "293,401": 1005,
    "301,99": 1006,
    "357,805": 1007,
    "105,309": 1008,
    "263,110": 1009,
    "116,300": 1010,
    "269,98": 1011,
    "415,112": 1012,
    "266,109": 1013,
    "286,399": 1014,
    "117,549": 1015,
    "311,264": 1016,
    "498,296": 1017,
    "266,784": 1018,
    "111,332": 1019,
    "794,282": 1020,
    "842,115": 1021,
    "609,99": 1022,
    "335,101": 1023,
    "49,51": 1024,
    "116,375": 1025,
    "283,305": 1026,
    "117,267": 1027,
    "564,267": 1028,
    "116,259": 1029,
    "352,101": 1030,
    "32,90": 1031,
    "692,409": 1032,
    "322,114": 1033,
    "32,385": 1034,
    "378,121": 1035,
    "399,296": 1036,
    "367,99": 1037,
    "109,121": 1038,
    "292,271": 1039,
    "627,112": 1040,
    "364,279": 1041,
    "387,352": 1042,
    "116,121": 1043,
    "286,518": 1044,
    "412,285": 1045,
    "347,717": 1046,
    "364,104": 1047,
    "400,118": 1048,
    "293,389": 1049,
    "849,267": 1050,
    "293,540": 1051,
    "377,55": 1052,
    "297,445": 1053,
    "312,433": 1054,
    "730,319": 1055,
    "764,628": 1056,
    "586,99": 1057,
    "327,277": 1058,
    "266,522": 1059,
    "104,121": 1060,
    "303,480": 1061,
    "488,439": 1062,
    "700,405": 1063,
    "463,115": 1064,
    "280,306": 1065,
    "269,618": 1066,
    "466,319": 1067,
    "609,522": 1068,
    "282,456": 1069,
    "363,114": 1070,
    "316,341": 1071,
    "772,650": 1072,
    "323,790": 1073,
    "311,108": 1074,
    "278,109": 1075,
    "283,102": 1076,
    "105,384": 1077,
    "326,267": 1078,
    "49,52": 1079,
    "485,1010": 1080,
    "595,290": 1081,
    "389,115": 1082,
    "310,504": 1083,
    "262,445": 1084,
    "292,341": 1085,
    "293,985": 1086,
    "120,116": 1087,
    "114,396": 1088,
    "101,98": 1089,
    "276,261": 1090,
    "377,54": 1091,
    "117,450": 1092,
    "275,477": 1093,
    "321,115": 1094,
    "84,259": 1095,
    "311,325": 1096,
    "514,116": 1097,
    "335,295": 1098,
    "306,115": 1099,
    "532,112": 1100,
    "704,271": 1101,
    "844,290": 1102,
    "269,538": 1103,
    "365,428": 1104,
    "351,483": 1105,
    "376,267": 1106,
    "537,101": 1107,
    "887,272": 1108,
    "269,909": 1109,
    "195,169": 1110,
    "286,640": 1111,
    "266,434": 1112,
    "103,385": 1113,
    "322,108": 1114,
    "912,496": 1115,
    "292,300": 1116,
    "1022,695": 1117,
    "1003,295": 1118,
    "276,309": 1119,
    "266,327": 1120,
    "362,108": 1121,
    "263,118": 1122,
    "97,120": 1123,
    "121,112": 1124,
    "305,355": 1125,
    "307,361": 1126,
    "368,264": 1127,
    "118,302": 1128,
    "804,1036": 1129,
    "283,115": 1130,
    "309,267": 1131,
    "342,422": 1132,
    "311,279": 1133,
    "269,488": 1134,
    "461,645": 1135,
    "32,36": 1136,
    "726,480": 1137,
    "616,296": 1138,
    "292,391": 1139,
    "268,261": 1140,
    "377,53": 1141,
    "323,972": 1142,
    "303,1137": 1143,
    "483,597": 1144,
    "261,107": 1145,
    "333,115": 1146,
    "453,1062": 1147,
    "98,121": 1148,
    "261,97": 1149,
    "652,448": 1150,
    "275,651": 1151,
    "714,1144": 1152,
    "342,114": 1153,
    "260,834": 1154,
    "367,305": 1155,
    "103,263": 1156,
    "398,105": 1157,
    "314,267": 1158,
    "32,37": 1159,
    "376,115": 1160,
    "323,117": 1161,
    "356,101": 1162,
    "907,334": 1163,
    "261,99": 1164,
    "304,575": 1165,
    "716,872": 1166,
    "444,83": 1167,
    "375,115": 1168,
    "312,707": 1169,
    "596,118": 1170,
    "465,101": 1171,
    "266,731": 1172,
    "294,389": 1173,
    "286,111": 1174,
    "114,278": 1175,
    "364,783": 1176,
    "424,115": 1177,
    "817,285": 1178,
    "451,109": 1179,
    "34,119": 1180,
    "552,372": 1181,
    "363,272": 1182,
    "99,107": 1183,
    "112,267": 1184,
    "519,518": 1185,
    "310,296": 1186,
    "706,326": 1187,
    "289,516": 1188,
    "276,440": 1189,
    "117,277": 1190,
    "275,436": 1191,
    "386,117": 1192,
    "101,120": 1193,
    "581,918": 1194,
    "51,48": 1195,
    "383,285": 1196,
    "741,567": 1197,
    "114,389": 1198,
    "263,646": 1199,
    "303,100": 1200,
    "1013,419": 1201,
    "307,847": 1202,
    "299,567": 1203,
    "374,465": 1204,
    "377,51": 1205,
    "653,115": 1206,
    "310,598": 1207,
    "788,684": 1208,
    "32,267": 1209,
    "398,279": 1210,
    "280,688": 1211,
    "116,296": 1212,
    "331,277": 1213,
    "293,114": 1214,
    "590,433": 1215,
    "103,261": 1216,
    "277,112": 1217,
    "103,321": 1218,
    "260,335": 1219,
    "459,97": 1220,
    "49,49": 1221,
    "592,108": 1222,
    "276,696": 1223,
    "378,110": 1224,
    "386,1030": 1225,
    "1061,799": 1226,
    "339,859": 1227,
    "427,116": 1228,
    "475,285": 1229,
    "310,344": 1230,
    "377,49": 1231,
    "484,319": 1232,
    "349,108": 1233,
    "374,707": 1234,
    "320,357": 1235,
    "331,285": 1236,
    "50,53": 1237,
    "397,372": 1238,
    "939,796": 1239,
    "284,277": 1240,
    "291,108": 1241,
    "300,436": 1242,
    "356,318": 1243,
    "271,579": 1244,
    "375,285": 1245,
    "110,263": 1246,
    "342,421": 1247,
    "457,115": 1248,
    "108,285": 1249,
    "324,121": 1250,
    "282,117": 1251,
    "855,290": 1252,
    "382,313": 1253,
    "109,267": 1254,
    "286,381": 1255,
    "683,295": 1256,
    "404,100": 1257,
    "268,406": 1258,
    "292,1108": 1259,
    "311,282": 1260,
    "300,116": 1261,
    "273,101": 1262,
    "869,1125": 1263,
    "338,115": 1264,
    "593,290": 1265,
    "32,81": 1266,
    "1238,952": 1267,
    "258,390": 1268,
    "367,102": 1269,
    "265,116": 1270,
    "280,111": 1271,
    "266,905": 1272,
    "642,927": 1273,
    "105,302": 1274,
    "295,284": 1275,
    "649,529": 1276,
    "307,454": 1277,
    "266,1007": 1278,
    "803,109": 1279,
    "292,267": 1280,
    "292,279": 1281,
    "502,693": 1282,
    "978,300": 1283,
    "326,456": 1284,
    "108,496": 1285,
    "1192,319": 1286,
    "331,579": 1287,
    "1204,597": 1288,
    "841,456": 1289,
    "299,102": 1290,
    "310,770": 1291,
    "303,1283": 1292,
    "928,296": 1293,
    "371,1199": 1294,
    "307,479": 1295,
    "462,693": 1296,
    "112,272": 1297,
    "261,267": 1298,
    "271,115": 1299,
    "293,321": 1300,
    "268,783": 1301,
    "116,111": 1302,
    "349,291": 1303,
    "734,357": 1304,
    "308,321": 1305,
    "392,100": 1306,
    "396,282": 1307,
    "320,284": 1308,
    "382,108": 1309,
    "365,547": 1310,
    "299,305": 1311,
    "446,267": 1312,
    "355,483": 1313,
    "291,119": 1314,
    "259,305": 1315,
    "280,766": 1316,
    "99,108": 1317,
    "446,295": 1318,
    "852,358": 1319,
    "1005,691": 1320,
    "492,265": 1321,
    "401,658": 1322,
    "98,419": 1323,
    "316,99": 1324,
    "98,296": 1325,
    "34,361": 1326,
    "298,114": 1327,
    "692,497": 1328,
    "322,101": 1329,
    "514,114": 1330,
    "97,327": 1331,
    "1243,597": 1332,
    "359,271": 1333,
    "386,1307": 1334,
    "541,118": 1335,
    "813,115": 1336,
    "380,525": 1337,
    "266,758": 1338,
    "292,929": 1339,
    "591,480": 1340,
    "273,103": 1341,
    "356,572": 1342,
    "269,402": 1343,
    "301,758": 1344,
    "115,104": 1345,
    "380,267": 1346,
    "1251,478": 1347,
    "371,117": 1348,
    "304,926": 1349,
    "32,91": 1350,
    "307,274": 1351,
    "308,282": 1352,
    "280,361": 1353,
    "386,1347": 1354,
    "280,650": 1355,
    "275,662": 1356,
    "606,267": 1357,
    "644,302": 1358,
    "378,890": 1359,
    "302,319": 1360,
    "427,551": 1361,
    "312,434": 1362,
    "291,499": 1363,
    "266,108": 1364,
    "293,525": 1365,
    "630,267": 1366,
    "258,274": 1367,
    "1117,267": 1368,
    "437,413": 1369,
    "284,102": 1370,
    "590,291": 1371,
    "364,406": 1372,
    "654,357": 1373,
    "294,528": 1374,
    "371,114": 1375,
    "112,296": 1376,
    "286,104": 1377,
    "435,617": 1378,
    "442,285": 1379,
    "398,278": 1380,
    "490,1198": 1381,
    "32,401": 1382,
    "322,121": 1383,
    "339,279": 1384,
    "268,1363": 1385,
    "400,103": 1386,
    "371,101": 1387,
    "274,284": 1388,
    "258,628": 1389,
    "391,121": 1390,
    "307,949": 1391,
    "1142,463": 1392,
    "280,265": 1393,
    "105,391": 1394,
    "300,279": 1395,
    "383,121": 1396,
    "349,104": 1397,
    "286,899": 1398,
    "323,768": 1399,
    "299,425": 1400,
    "451,406": 1401,
    "380,277": 1402,
    "342,605": 1403,
    "293,309": 1404,
    "278,334": 1405,
    "652,1313": 1406,
    "825,408": 1407,
    "264,121": 1408,
    "392,117": 1409,
    "268,341": 1410,
    "933,436": 1411,
    "97,102": 1412,
    "268,264": 1413,
    "299,1032": 1414,
    "286,413": 1415,
    "400,116": 1416,
    "286,279": 1417,
    "312,1131": 1418,
    "473,448": 1419,
    "286,1127": 1420,
    "1004,368": 1421,
    "333,73": 1422,
    "307,267": 1423,
    "105,568": 1424,
    "582,103": 1425,
    "258,924": 1426,
    "363,1373": 1427,
    "639,1328": 1428,
    "292,273": 1429,
    "316,264": 1430,
    "414,115": 1431,
    "284,107": 1432,
    "323,352": 1433,
    "289,618": 1434,
    "506,111": 1435,
    "1119,860": 1436,
    "397,114": 1437,
    "415,755": 1438,
    "292,701": 1439,
    "364,830": 1440,
    "294,361": 1441,
    "377,50": 1442,
    "349,114": 1443,
    "797,115": 1444,
    "788,1261": 1445,
    "308,261": 1446,
    "53,48": 1447,
    "320,476": 1448,
    "49,388": 1449,
    "292,615": 1450,
    "366,115": 1451,
    "275,449": 1452,
    "271,509": 1453,
    "322,291": 1454,
    "266,669": 1455,
    "101,282": 1456,
    "275,594": 1457,
    "104,309": 1458,
    "314,534": 1459,
    "331,273": 1460,
    "121,108": 1461,
    "1065,517": 1462,
    "265,119": 1463,
    "110,101": 1464,
    "115,938": 1465,
    "555,1394": 1466,
    "50,52": 1467,
    "307,421": 1468,
    "293,355": 1469,
    "431,717": 1470,
    "111,313": 1471,
    "326,277": 1472,
    "118,277": 1473,
    "98,114": 1474,
    "644,273": 1475,
    "273,99": 1476,
    "103,267": 1477,
    "265,273": 1478,
    "32,194": 1479,
    "304,698": 1480,
    "387,470": 1481,
    "293,385": 1482,
    "348,261": 1483,
    "112,115": 1484,
    "663,361": 1485,
    "274,503": 1486,
    "97,504": 1487,
    "342,524": 1488,
    "339,278": 1489,
    "99,534": 1490,
    "438,684": 1491,
    "1157,409": 1492,
    "104,272": 1493,
    "280,385": 1494,
    "39,116": 1495,
    "103,121": 1496,
    "110,439": 1497,
    "362,346": 1498,
    "299,551": 1499,
    "109,112": 1500,
    "523,1088": 1501,
    "412,273": 1502,
    "269,489": 1503,
    "655,1087": 1504,
    "263,116": 1505,
    "342,406": 1506,
    "292,1421": 1507,
    "331,821": 1508,
    "316,282": 1509,
    "921,576": 1510,
    "331,284": 1511,
    "32,38": 1512,
    "999,696": 1513,
    "1409,725": 1514,
    "965,267": 1515,
    "1034,423": 1516,
    "312,336": 1517,
    "289,112": 1518,
    "273,680": 1519,
    "275,114": 1520,
    "268,527": 1521,
    "116,284": 1522,
    "427,538": 1523,
    "349,279": 1524,
    "365,984": 1525,
    "273,445": 1526,
    "101,313": 1527,
    "1083,446": 1528,
    "429,105": 1529,
    "321,263": 1530,
    "105,272": 1531,
    "462,103": 1532,
    "591,640": 1533,
    "108,479": 1534,
    "283,274": 1535,
    "98,111": 1536,
    "287,334": 1537,
    "363,108": 1538,
    "1089,552": 1539,
    "274,478": 1540,
    "390,666": 1541,
    "335,267": 1542,
    "364,385": 1543,
    "813,121": 1544,
    "382,402": 1545,
    "97,563": 1546,
    "1539,478": 1547,
    "282,680": 1548,
    "303,270": 1549,
    "389,267": 1550,
    "266,107": 1551,
    "324,265": 1552,
    "99,264": 1553,
    "800,115": 1554,
    "330,544": 1555,
    "513,1241": 1556,
    "306,116": 1557,
    "363,1547": 1558,
    "276,352": 1559,
    "299,284": 1560,
    "332,116": 1561,
    "316,261": 1562,
    "275,320": 1563,
    "294,859": 1564,
    "339,263": 1565,
    "108,117": 1566,
    "276,409": 1567,
    "532,620": 1568,
    "111,264": 1569,
    "326,100": 1570,
    "1120,1395": 1571,
    "111,296": 1572,
    "275,434": 1573,
    "390,267": 1574,
    "374,761": 1575,
    "97,105": 1576,
    "275,719": 1577,
    "412,277": 1578,
    "97,117": 1579,
    "275,608": 1580,
    "266,302": 1581,
    "114,285": 1582,
    "316,417": 1583,
    "277,101": 1584,
    "400,112": 1585,
    "399,115": 1586,
    "374,111": 1587,
    "323,702": 1588,
    "1002,1027": 1589,
    "279,109": 1590,
    "725,484": 1591,
    "294,384": 1592,
    "271,290": 1593,
    "320,115": 1594,
    "292,380": 1595,
    "377,48": 1596,
    "110,637": 1597,
    "398,1435": 1598,
    "265,313": 1599,
    "303,328": 1600,
    "258,119": 1601,
    "50,51": 1602,
    "318,104": 1603,
    "1187,673": 1604,
    "552,613": 1605,
    "881,284": 1606,
    "303,109": 1607,
    "453,103": 1608,
    "266,506": 1609,
    "342,361": 1610,
    "396,112": 1611,
    "507,296": 1612,
    "904,302": 1613,
    "115,112": 1614,
    "1387,272": 1615,
    "277,672": 1616,
    "468,101": 1617,
    "258,1124": 1618,
    "1372,1008": 1619,
    "772,671": 1620,
    "296,118": 1621,
    "268,643": 1622,
    "50,49": 1623,
    "292,121": 1624,
    "415,98": 1625,
    "266,341": 1626,
    "281,883": 1627,
    "115,506": 1628,
    "1320,302": 1629,
    "843,428": 1630,
    "277,99": 1631,
    "308,273": 1632,
    "272,408": 1633,
    "286,471": 1634,
    "606,263": 1635,
    "963,274": 1636,
    "519,1331": 1637,
    "322,279": 1638,
    "276,265": 1639,
    "966,578": 1640,
    "291,121": 1641,
    "1260,313": 1642,
    "263,285": 1643,
    "819,101": 1644,
    "348,521": 1645,
    "332,115": 1646,
    "276,1448": 1647,
    "410,302": 1648,
    "469,297": 1649,
    "258,701": 1650,
    "310,425": 1651,
    "853,267": 1652,
    "425,101": 1653,
    "564,101": 1654,
    "108,263": 1655,
    "112,279": 1656,
    "97,362": 1657,
    "473,313": 1658,
    "1039,357": 1659,
    "1230,121": 1660,
    "311,651": 1661,
    "293,306": 1662,
    "396,101": 1663,
    "398,760": 1664,
    "338,104": 1665,
    "97,101": 1666,
    "260,118": 1667,
    "462,690": 1668,
    "1336,295": 1669,
    "846,107": 1670,
    "114,621": 1671,
    "814,883": 1672,
    "347,104": 1673,
    "979,121": 1674,
    "308,98": 1675,
    "1608,1113": 1676,
    "52,48": 1677,
    "296,116": 1678,
    "322,688": 1679,
    "265,321": 1680,
    "311,436": 1681,
    "581,528": 1682,
    "294,1370": 1683,
    "271,334": 1684,
    "291,556": 1685,
    "303,98": 1686,
    "34,102": 1687,
    "316,338": 1688,
    "99,1282": 1689,
    "1111,116": 1690,
    "276,1019": 1691,
    "966,1285": 1692,
    "311,302": 1693,
    "108,439": 1694,
    "435,282": 1695,
    "103,114": 1696,
    "271,272": 1697,
    "392,108": 1698,
    "349,615": 1699,
    "278,264": 1700,
    "50,54": 1701,
    "431,1001": 1702,
    "663,352": 1703,
    "276,533": 1704,
    "32,88": 1705,
    "303,488": 1706,
    "320,580": 1707,
    "656,101": 1708,
    "855,802": 1709,
    "102,475": 1710,
    "284,121": 1711,
    "627,567": 1712,
    "290,277": 1713,
    "400,102": 1714,
    "34,1029": 1715,
    "592,984": 1716,
    "50,56": 1717,
    "371,790": 1718,
    "307,471": 1719,
    "498,919": 1720,
    "507,313": 1721,
    "364,340": 1722,
    "958,121": 1723,
    "294,1196": 1724,
    "623,267": 1725,
    "32,306": 1726,
    "99,806": 1727,
    "263,121": 1728,
    "672,761": 1729,
    "50,55": 1730,
    "1076,1566": 1731,
    "908,325": 1732,
    "297,476": 1733,
    "268,385": 1734,
    "286,624": 1735,
    "364,101": 1736,
    "517,102": 1737,
    "322,111": 1738,
    "531,264": 1739,
    "323,482": 1740,
    "638,1411": 1741,
    "109,115": 1742,
    "121,110": 1743,
    "289,1522": 1744,
    "307,336": 1745,
    "276,404": 1746,
    "265,109": 1747,
    "662,503": 1748,
    "811,267": 1749,
    "280,287": 1750,
    "590,101": 1751,
    "303,102": 1752,
    "449,115": 1753,
    "394,98": 1754,
    "1153,428": 1755,
    "1733,110": 1756,
    "342,279": 1757,
    "294,1053": 1758,
    "260,504": 1759,
    "390,483": 1760,
    "344,115": 1761,
    "373,1739": 1762,
    "275,272": 1763,
    "264,277": 1764,
    "111,102": 1765,
    "318,751": 1766,
    "100,308": 1767,
    "424,267": 1768,
    "342,432": 1769,
    "307,439": 1770,
    "266,429": 1771,
    "323,273": 1772,
    "121,285": 1773,
    "445,425": 1774,
    "310,470": 1775,
    "431,100": 1776,
    "753,116": 1777,
    "265,305": 1778,
    "327,302": 1779,
    "310,454": 1780,
    "299,691": 1781,
    "1203,267": 1782,
    "294,329": 1783,
    "50,50": 1784,
    "285,737": 1785,
    "311,284": 1786,
    "490,279": 1787,
    "1056,267": 1788,
    "762,629": 1789,
    "302,295": 1790,
    "797,576": 1791,
    "937,115": 1792,
    "655,267": 1793,
    "268,302": 1794,
    "258,291": 1795,
    "258,355": 1796,
    "99,263": 1797,
    "1386,932": 1798,
    "999,261": 1799,
    "335,277": 1800,
    "307,97": 1801,
    "323,1460": 1802,
    "287,672": 1803,
    "663,264": 1804,
    "630,101": 1805,
    "374,101": 1806,
    "276,643": 1807,
    "121,296": 1808,
    "266,600": 1809,
    "354,974": 1810,
    "655,344": 1811,
    "425,313": 1812,
    "423,319": 1813,
    "296,279": 1814,
    "378,116": 1815,
    "1116,1540": 1816,
    "328,99": 1817,
    "276,621": 1818,
    "1482,1641": 1819,
    "307,470": 1820,
    "259,109": 1821,
    "438,626": 1822,
    "1047,561": 1823,
    "338,267": 1824,
    "286,271": 1825,
    "376,112": 1826,
    "325,108": 1827,
    "99,439": 1828,
    "276,947": 1829,
    "1173,605": 1830,
    "451,101": 1831,
    "1621,821": 1832,
    "263,114": 1833,
    "551,664": 1834,
    "712,103": 1835,
    "339,407": 1836,
    "266,325": 1837,
    "307,686": 1838,
    "1224,481": 1839,
    "387,313": 1840,
    "109,471": 1841,
    "877,118": 1842,
    "1707,868": 1843,
    "537,285": 1844,
    "469,481": 1845,
    "762,613": 1846,
    "541,109": 1847,
    "654,116": 1848,
    "543,57": 1849,
    "498,321": 1850,
    "1265,798": 1851,
    "437,494": 1852,
    "1219,1493": 1853,
    "300,296": 1854,
    "294,336": 1855,
    "1718,284": 1856,
    "312,413": 1857,
    "311,111": 1858,
    "959,1689": 1859,
    "951,116": 1860,
    "1706,1229": 1861,
    "594,110": 1862,
    "276,1541": 1863,
    "1151,548": 1864,
    "308,112": 1865,
    "803,112": 1866,
    "752,115": 1867,
    "103,277": 1868,
    "275,454": 1869,
    "101,102": 1870,
    "356,383": 1871,
    "276,116": 1872,
    "1457,263": 1873,
    "279,110": 1874,
    "733,115": 1875,
    "391,277": 1876,
    "323,679": 1877,
    "367,118": 1878,
    "342,271": 1879,
    "936,1648": 1880,
    "1208,285": 1881,
    "258,273": 1882,
    "258,1058": 1883,
    "114,341": 1884,
    "502,119": 1885,
    "299,313": 1886,
    "307,327": 1887,
    "274,440": 1888,
    "647,1465": 1889,
    "274,345": 1890,
    "278,285": 1891,
    "97,522": 1892,
    "633,440": 1893,
    "292,1045": 1894,
    "271,357": 1895,
    "386,768": 1896,
    "400,916": 1897,
    "324,445": 1898,
    "266,274": 1899,
    "299,100": 1900,
    "32,506": 1901,
    "1093,290": 1902,
    "115,99": 1903,
    "519,510": 1904,
    "284,100": 1905,
    "345,110": 1906,
    "276,900": 1907,
    "267,263": 1908,
    "50,57": 1909,
    "366,578": 1910,
    "330,680": 1911,
    "326,568": 1912,
    "282,97": 1913,
    "311,272": 1914,
    "1367,296": 1915,
    "551,341": 1916,
    "387,747": 1917,
    "384,302": 1918,
    "261,439": 1919,
    "453,504": 1920,
    "1170,601": 1921,
    "1319,115": 1922,
    "352,103": 1923,
    "664,284": 1924,
    "104,290": 1925,
    "102,290": 1926,
    "700,455": 1927,
    "983,463": 1928,
    "836,1021": 1929,
    "390,277": 1930,
    "114,346": 1931,
    "1211,296": 1932,
    "1226,474": 1933,
    "111,120": 1934,
    "392,120": 1935,
    "461,421": 1936,
    "1748,740": 1937,
    "749,385": 1938,
    "624,295": 1939,
    "110,97": 1940,
    "1014,798": 1941,
    "266,1305": 1942,
    "891,448": 1943,
    "278,99": 1944,
    "301,119": 1945,
    "274,558": 1946,
    "526,1685": 1947,
    "715,839": 1948,
    "473,383": 1949,
    "284,358": 1950,
    "1752,580": 1951,
    "275,1021": 1952,
    "276,114": 1953,
    "564,346": 1954,
    "265,309": 1955,
    "1661,121": 1956,
    "467,267": 1957,
    "983,267": 1958,
    "280,338": 1959,
    "1059,870": 1960,
    "314,277": 1961,
    "342,101": 1962,
    "293,658": 1963,
    "260,697": 1964,
    "321,116": 1965,
    "34,115": 1966,
    "708,1038": 1967,
    "286,502": 1968,
    "1334,1584": 1969,
    "323,321": 1970,
    "301,109": 1971,
    "34,97": 1972,
    "276,1557": 1973,
    "1081,466": 1974,
    "418,273": 1975,
    "101,101": 1976,
    "289,320": 1977,
    "301,318": 1978,
    "331,300": 1979,
    "119,529": 1980,
    "299,1459": 1981,
    "1173,272": 1982,
    "907,792": 1983,
    "266,119": 1984,
    "276,355": 1985,
    "1210,893": 1986,
    "259,108": 1987,
    "462,116": 1988,
    "507,455": 1989,
    "460,153": 1990,
    "316,267": 1991,
    "275,263": 1992,
    "383,284": 1993,
    "1011,115": 1994,
    "108,802": 1995,
    "475,115": 1996,
    "102,947": 1997,
    "438,422": 1998,
    "298,101": 1999,
    "325,1098": 2000,
    "107,115": 2001,
    "97,306": 2002,
    "260,344": 2003,
    "349,263": 2004,
    "54,48": 2005,
    "312,470": 2006,
    "308,109": 2007,
    "624,267": 2008,
    "258,1766": 2009,
    "301,121": 2010,
    "459,287": 2011,
    "1147,967": 2012,
    "418,975": 2013,
    "98,115": 2014,
    "266,384": 2015,
    "773,588": 2016,
    "261,346": 2017,
    "327,1244": 2018,
    "711,108": 2019,
    "759,296": 2020,
    "321,104": 2021,
    "323,108": 2022,
    "619,1832": 2023,
    "266,264": 2024,
    "767,521": 2025,
    "574,265": 2026,
    "386,448": 2027,
    "260,456": 2028,
    "275,121": 2029,
    "367,100": 2030,
    "260,653": 2031,
    "354,952": 2032,
    "378,327": 2033,
    "1516,1995": 2034,
    "259,265": 2035,
    "265,103": 2036,
    "730,108": 2037,
    "759,108": 2038,
    "398,284": 2039,
    "1014,1498": 2040,
    "399,101": 2041,
    "276,383": 2042,
    "312,761": 2043,
    "354,318": 2044,
    "697,115": 2045,
    "596,713": 2046,
    "1491,654": 2047,
    "968,432": 2048,
    "876,103": 2049,
    "1476,121": 2050,
    "1180,287": 2051,
    "1401,267": 2052,
    "818,1337": 2053,
    "292,326": 2054,
    "371,108": 2055,
    "735,327": 2056,
    "307,389": 2057,
    "347,1216": 2058,
    "709,290": 2059,
    "32,861": 2060,
    "1356,1892": 2061,
    "1615,456": 2062,
    "1057,608": 2063,
    "349,325": 2064,
    "1255,332": 2065,
    "356,1508": 2066,
    "398,325": 2067,
    "105,368": 2068,
    "582,99": 2069,
    "392,454": 2070,
    "580,116": 2071,
    "606,368": 2072,
    "794,97": 2073,
    "287,277": 2074,
    "392,279": 2075,
    "294,274": 2076,
    "342,346": 2077,
    "312,465": 2078,
    "700,119": 2079,
    "258,1502": 2080,
    "275,471": 2081,
    "330,351": 2082,
    "99,454": 2083,
    "292,109": 2084,
    "289,111": 2085,
    "882,533": 2086,
    "356,114": 2087,
    "286,335": 2088,
    "423,272": 2089,
    "1351,1212": 2090,
    "514,109": 2091,
    "273,629": 2092,
    "280,279": 2093,
    "530,296": 2094,
    "765,321": 2095,
    "817,267": 2096,
    "109,273": 2097,
    "312,264": 2098,
    "362,97": 2099,
    "275,620": 2100,
    "814,285": 2101,
    "1132,267": 2102,
    "988,573": 2103,
    "34,261": 2104,
    "258,1591": 2105,
    "268,326": 2106,
    "980,457": 2107,
    "1073,284": 2108,
    "354,417": 2109,
    "274,285": 2110,
    "543,54": 2111,
    "375,116": 2112,
    "1636,484": 2113,
    "105,416": 2114,
    "97,320": 2115,
    "280,1390": 2116,
    "543,56": 2117,
    "331,326": 2118,
    "268,1632": 2119,
    "271,97": 2120,
    "1134,320": 2121,
    "1960,424": 2122,
    "387,1069": 2123,
    "1146,578": 2124,
    "263,97": 2125,
    "1165,116": 2126,
    "1839,629": 2127,
    "98,101": 2128,
    "301,327": 2129,
    "280,671": 2130,
    "276,296": 2131,
    "308,285": 2132,
    "104,285": 2133,
    "881,432": 2134,
    "556,372": 2135,
    "1309,112": 2136,
    "309,302": 2137,
    "575,116": 2138,
    "704,321": 2139,
    "275,481": 2140,
    "400,1828": 2141,
    "105,318": 2142,
    "461,1680": 2143,
    "359,634": 2144,
    "275,1817": 2145,
    "276,314": 2146,
    "367,110": 2147,
    "1060,115": 2148,
    "472,285": 2149,
    "349,410": 2150,
    "342,1181": 2151,
    "1116,277": 2152,
    "292,597": 2153,
    "307,1160": 2154,
    "812,267": 2155,
    "276,1121": 2156,
    "299,118": 2157,
    "911,454": 2158,
    "111,601": 2159,
    "992,313": 2160,
    "287,285": 2161,
    "1712,424": 2162,
    "275,399": 2163,
    "988,267": 2164,
    "580,107": 2165,
    "328,108": 2166,
    "320,98": 2167,
    "110,336": 2168,
    "354,641": 2169,
    "284,116": 2170,
    "507,1183": 2171,
    "398,101": 2172,
    "286,390": 2173,
    "32,1631": 2174,
    "34,100": 2175,
    "884,277": 2176,
    "662,296": 2177,
    "307,766": 2178,
    "1577,267": 2179,
    "266,634": 2180,
    "514,357": 2181,
    "1226,457": 2182,
    "825,466": 2183,
    "308,277": 2184,
    "641,666": 2185,
    "289,1218": 2186,
    "2186,345": 2187,
    "259,313": 2188,
    "318,335": 2189,
    "612,380": 2190,
    "610,115": 2191,
    "413,115": 2192,
    "507,1023": 2193,
    "280,419": 2194,
    "1109,267": 2195,
    "307,894": 2196,
    "1139,1009": 2197,
    "119,104": 2198,
    "523,110": 2199,
    "294,669": 2200,
    "100,341": 2201,
    "384,98": 2202,
    "305,263": 2203,
    "276,470": 2204,
    "354,1352": 2205,
    "1812,753": 2206,
    "769,331": 2207,
    "316,101": 2208,
    "34,83": 2209,
    "1040,291": 2210,
    "293,331": 2211,
    "342,390": 2212,
    "355,121": 2213,
    "339,273": 2214,
    "292,332": 2215,
    "1017,558": 2216,
    "383,277": 2217,
    "284,436": 2218,
    "770,267": 2219,
    "299,556": 2220,
    "566,107": 2221,
    "1026,1527": 2222,
    "274,357": 2223,
    "1111,570": 2224,
    "287,107": 2225,
    "354,1264": 2226,
    "711,1078": 2227,
    "1751,981": 2228,
    "342,1808": 2229,
    "294,471": 2230,
    "260,426": 2231,
    "1155,1605": 2232,
    "111,504": 2233,
    "1397,300": 2234,
    "660,116": 2235,
    "396,115": 2236,
    "1114,448": 2237,
    "387,97": 2238,
    "292,731": 2239,
    "1070,573": 2240,
    "298,111": 2241,
    "462,454": 2242,
    "968,119": 2243,
    "303,372": 2244,
    "195,161": 2245,
    "1358,1015": 2246,
    "418,101": 2247,
    "274,279": 2248,
    "301,1007": 2249,
    "279,97": 2250,
    "266,686": 2251,
    "416,116": 2252,
    "354,1471": 2253,
    "514,103": 2254,
    "351,267": 2255,
    "117,107": 2256,
    "313,277": 2257,
    "424,290": 2258,
    "1433,115": 2259,
    "272,285": 2260,
    "316,314": 2261,
    "1801,352": 2262,
    "736,336": 2263,
    "301,405": 2264,
    "110,267": 2265,
    "322,406": 2266,
    "280,1675": 2267,
    "301,263": 2268,
    "921,267": 2269,
    "1926,620": 2270,
    "342,542": 2271,
    "354,1924": 2272,
    "292,683": 2273,
    "400,1325": 2274,
    "374,272": 2275,
    "508,391": 2276,
    "258,263": 2277,
    "99,302": 2278,
    "1266,117": 2279,
    "261,116": 2280,
    "500,328": 2281,
    "275,335": 2282,
    "352,107": 2283,
    "364,300": 2284,
    "543,55": 2285,
    "328,264": 2286,
    "1100,446": 2287,
    "292,527": 2288,
    "1101,961": 2289,
    "333,114": 2290,
    "394,463": 2291,
    "1658,576": 2292,
    "99,300": 2293,
    "1005,2270": 2294,
    "606,285": 2295,
    "271,665": 2296,
    "258,385": 2297,
    "349,422": 2298,
    "275,671": 2299,
    "290,432": 2300,
    "1592,282": 2301,
    "355,678": 2302,
    "276,419": 2303,
    "418,1656": 2304,
    "472,115": 2305,
    "1130,112": 2306,
    "1553,308": 2307,
    "111,326": 2308,
    "2016,740": 2309,
    "349,413": 2310,
    "590,640": 2311,
    "1048,1078": 2312,
    "283,674": 2313,
    "102,272": 2314,
    "461,101": 2315,
    "519,376": 2316,
    "382,1396": 2317,
    "53,388": 2318,
    "339,309": 2319,
    "644,678": 2320,
    "294,121": 2321,
    "522,267": 2322,
    "276,1777": 2323,
    "826,358": 2324,
    "1254,105": 2325,
    "349,101": 2326,
    "1673,643": 2327,
    "1310,267": 2328,
    "103,103": 2329,
    "795,295": 2330,
    "837,2118": 2331,
    "276,329": 2332,
    "1570,296": 2333,
    "337,107": 2334,
    "117,296": 2335,
    "299,598": 2336,
    "451,285": 2337,
    "317,351": 2338,
    "969,479": 2339,
    "415,118": 2340,
    "1714,439": 2341,
    "314,121": 2342,
    "258,265": 2343,
    "676,115": 2344,
    "294,264": 2345,
    "98,320": 2346,
    "626,117": 2347,
    "1404,542": 2348,
    "1425,479": 2349,
    "34,99": 2350,
    "316,313": 2351,
    "398,406": 2352,
    "299,110": 2353,
    "365,1841": 2354,
    "307,448": 2355,
    "2003,542": 2356,
    "292,263": 2357,
    "562,1257": 2358,
    "735,621": 2359,
    "286,450": 2360,
    "809,1774": 2361,
    "316,272": 2362,
    "392,109": 2363,
    "34,40": 2364,
    "270,263": 2365,
    "836,1105": 2366,
    "1341,358": 2367,
    "387,900": 2368,
    "1799,549": 2369,
    "292,620": 2370,
    "602,264": 2371,
    "380,264": 2372,
    "427,2177": 2373,
    "950,285": 2374,
    "801,1529": 2375,
    "723,285": 2376,
    "979,484": 2377,
    "908,385": 2378,
    "837,480": 2379,
    "276,401": 2380,
    "364,970": 2381,
    "398,429": 2382,
    "406,115": 2383,
    "260,613": 2384,
    "992,476": 2385,
    "1845,103": 2386,
    "292,518": 2387,
    "279,357": 2388,
    "804,412": 2389,
    "299,98": 2390,
    "307,440": 2391,
    "1514,101": 2392,
    "446,115": 2393,
    "293,297": 2394,
    "519,698": 2395,
    "103,111": 2396,
    "676,267": 2397,
    "1795,1586": 2398,
    "116,114": 2399,
    "1273,115": 2400,
    "387,617": 2401,
    "514,1038": 2402,
    "283,106": 2403,
    "301,357": 2404,
    "1093,838": 2405,
    "1073,549": 2406,
    "266,1756": 2407,
    "396,263": 2408,
    "280,2235": 2409,
    "309,97": 2410,
    "273,267": 2411,
    "1664,605": 2412,
    "1866,919": 2413,
    "275,702": 2414,
    "1034,327": 2415,
    "356,1217": 2416,
    "34,112": 2417,
    "109,285": 2418,
    "73,110": 2419,
    "655,103": 2420,
    "111,272": 2421,
    "339,1053": 2422,
    "56,48": 2423,
    "310,1890": 2424,
    "559,2199": 2425,
    "422,463": 2426,
    "105,338": 2427,
    "1042,115": 2428,
    "389,290": 2429,
    "268,1768": 2430,
    "51,49": 2431,
    "301,528": 2432,
    "371,291": 2433,
    "264,116": 2434,
    "2288,466": 2435,
    "676,285": 2436,
    "442,101": 2437,
    "435,1158": 2438,
    "117,504": 2439,
    "418,425": 2440,
    "857,108": 2441,
    "380,111": 2442,
    "305,264": 2443,
    "1233,341": 2444,
    "302,466": 2445,
    "309,98": 2446,
    "775,694": 2447,
    "1871,326": 2448,
    "32,122": 2449,
    "276,429": 2450,
    "34,109": 2451,
    "51,53": 2452,
    "964,1834": 2453,
    "1536,414": 2454,
    "304,702": 2455,
    "421,103": 2456,
    "987,284": 2457,
    "1835,306": 2458,
    "2381,1785": 2459,
    "357,517": 2460,
    "294,1843": 2461,
    "117,306": 2462,
    "301,282": 2463,
    "34,98": 2464,
    "1642,97": 2465,
    "290,97": 2466,
    "292,105": 2467,
    "34,66": 2468,
    "775,279": 2469,
    "292,890": 2470,
    "341,115": 2471,
    "276,472": 2472,
    "294,1753": 2473,
    "266,449": 2474,
    "275,101": 2475,
    "1381,457": 2476,
    "398,332": 2477,
    "303,103": 2478,
    "1583,2002": 2479,
    "299,756": 2480,
    "363,2376": 2481,
    "1533,267": 2482,
    "310,2307": 2483,
    "1462,713": 2484,
    "55,48": 2485,
    "99,111": 2486,
    "118,284": 2487,
    "449,110": 2488,
    "276,279": 2489,
    "2078,306": 2490,
    "307,2367": 2491,
    "1499,1158": 2492,
    "282,357": 2493,
    "276,455": 2494,
    "280,926": 2495,
    "289,1206": 2496,
    "354,267": 2497,
    "297,108": 2498,
    "99,345": 2499,
    "102,419": 2500,
    "691,568": 2501,
    "1679,296": 2502,
    "532,362": 2503,
    "2281,1216": 2504,
    "565,308": 2505,
    "268,949": 2506,
    "276,566": 2507,
    "1101,1092": 2508,
    "418,120": 2509,
    "99,285": 2510,
    "2032,116": 2511,
    "290,111": 2512,
    "831,313": 2513,
    "387,623": 2514,
    "349,1657": 2515,
    "305,274": 2516,
    "284,295": 2517,
    "438,1235": 2518,
    "339,325": 2519,
    "1186,1064": 2520,
    "1090,802": 2521,
    "298,508": 2522,
    "1959,1919": 2523,
    "780,264": 2524,
    "373,297": 2525,
    "2150,861": 2526,
    "280,757": 2527,
    "119,385": 2528,
    "562,1262": 2529,
    "305,361": 2530,
    "271,1308": 2531,
    "2214,548": 2532,
    "97,335": 2533,
    "496,285": 2534,
    "1265,441": 2535,
    "609,112": 2536,
    "543,53": 2537,
    "426,101": 2538,
    "294,272": 2539,
    "595,601": 2540,
    "1563,1848": 2541,
    "363,487": 2542,
    "307,2347": 2543,
    "268,419": 2544,
    "841,1113": 2545,
    "760,295": 2546,
    "1068,267": 2547,
    "1732,713": 2548,
    "112,319": 2549,
    "390,282": 2550,
    "1667,623": 2551,
    "870,346": 2552,
    "355,115": 2553,
    "371,702": 2554,
    "2416,634": 2555,
    "427,389": 2556,
    "273,277": 2557,
    "773,329": 2558,
    "401,102": 2559,
    "261,110": 2560,
    "397,476": 2561,
    "32,195": 2562,
    "342,552": 2563,
    "513,114": 2564,
    "404,115": 2565,
    "651,375": 2566,
    "485,925": 2567,
    "263,497": 2568,
    "433,357": 2569,
    "1691,1323": 2570,
    "2037,923": 2571,
    "795,798": 2572,
    "1479,176": 2573,
    "980,474": 2574,
    "490,1235": 2575,
    "349,284": 2576,
    "66,67": 2577,
    "1444,1138": 2578,
    "316,1193": 2579,
    "387,362": 2580,
    "105,1653": 2581,
    "433,115": 2582,
    "1109,285": 2583,
    "1379,1767": 2584,
    "115,306": 2585,
    "1535,1067": 2586,
    "716,799": 2587,
    "108,290": 2588,
    "107,121": 2589,
    "316,300": 2590,
    "774,470": 2591,
    "437,332": 2592,
    "118,1854": 2593,
    "1452,116": 2594,
    "287,121": 2595,
    "316,111": 2596,
    "1324,67": 2597,
    "261,111": 2598,
    "795,414": 2599,
    "2109,414": 2600,
    "280,105": 2601,
    "400,538": 2602,
    "292,833": 2603,
    "363,381": 2604,
    "401,757": 2605,
    "1209,846": 2606,
    "735,331": 2607,
    "312,279": 2608,
    "280,406": 2609,
    "394,544": 2610,
    "284,267": 2611,
    "904,861": 2612,
    "312,1446": 2613,
    "296,103": 2614,
    "294,497": 2615,
    "424,548": 2616,
    "1626,285": 2617,
    "329,282": 2618,
    "1321,650": 2619,
    "274,499": 2620,
    "1011,916": 2621,
    "117,334": 2622,
    "322,335": 2623,
    "118,285": 2624,
    "261,389": 2625,
    "34,1095": 2626,
    "32,406": 2627,
    "777,267": 2628,
    "311,396": 2629,
    "1059,267": 2630,
    "765,287": 2631,
    "305,114": 2632,
    "100,273": 2633,
    "282,474": 2634,
    "1514,1456": 2635,
    "649,297": 2636,
    "603,121": 2637,
    "775,385": 2638,
    "412,263": 2639,
    "2189,440": 2640,
    "747,115": 2641,
    "957,267": 2642,
    "279,105": 2643,
    "1086,272": 2644,
    "1968,906": 2645,
    "1086,267": 2646,
    "1857,1906": 2647,
    "283,110": 2648,
    "307,121": 2649,
    "473,1245": 2650,
    "490,1937": 2651,
    "108,261": 2652,
    "316,320": 2653,
    "1044,267": 2654,
    "294,414": 2655,
    "107,105": 2656,
    "513,695": 2657,
    "103,273": 2658,
    "339,419": 2659,
    "263,713": 2660,
    "427,99": 2661,
    "258,1045": 2662,
    "308,115": 2663,
    "286,2148": 2664,
    "287,295": 2665,
    "301,285": 2666,
    "2605,474": 2667,
    "330,629": 2668,
    "2505,287": 2669,
    "1100,670": 2670,
    "877,102": 2671,
    "864,697": 2672,
    "715,465": 2673,
